{
    "name": "Castle Black",
    "id": "castlebl",
    "subroutines": [],
    "rooms": {
        "32233": {
            "name": "{WB{wefore {Wt{whe {WD{wouble {WD{woors{x",
            "description": [
                "Massive black doors block the entrance, constructed of solid black",
                "marble.  It looks as though the entire castle is also made of the same",
                "material.  The cost to build such a castle would be incredible, more than",
                "the entire Tri Power treasury.  It would seem that this Lord Morrolan is not",
                "only powerful, in being able to levitate an entire mountain and control the",
                "weather atop it, but incredibly rich as well.  The sounds of typical city",
                "life can be heard through the doors.  A marble plaque hangs from the door:",
                " ",
                "{W                    _________________________{w.",
                "{W                   |{w'.{W________________________{w'.",
                "{W                   | |{wo                       o{W|",
                "{W                   | |  {wIf Lady Teldra is not  {W|",
                "{W                   | |  {wpresent,  please wait  {W|",
                "{W                   | |  {win the foyer  and she  {W|",
                "{W                   | |  {wwill be with you in a  {W|",
                "{W                   | |  {wfew moments.           {W|",
                "{w                    '{W|_________________________|{x"
            ],
            "flags_raw": "0 0 0 11",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32233",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32234"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32232"
                }
            },
            "extras": {}
        },
        "32208": {
            "name": "{RR{river {Ro{rf {RF{rire{x",
            "description": [
                "The breath from your lungs is stolen as you strain for breath.  A",
                "raging river of fire pulses and burbles down below as it continues on",
                "it's course towards the nearest body of water, releasing it's",
                "tormentive heat wherever it goes.  A slab of black granite stretches",
                "across the river of fire, consuming it and you in fumes and smoke.  It",
                "would be possible to cross it, but you would have to go about it",
                "quickly.  Out of the corner of your eye, you notice something stirring",
                "below you in the lava.  Maybe it was only your imagination, for the",
                "heat and fumes at this point are unbearable.  "
            ],
            "flags_raw": "0 0 0 10",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32208",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32207"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32209"
                }
            },
            "extras": {}
        },
        "32267": {
            "name": "{WE{wast {WW{wall{x",
            "description": [
                "This wall has an interesting tapestry.  It is a picture of a swampy march",
                "with the head of some sort of lizard-like creature.  It looks similar to an",
                "alligator but has very smooth skin with blue swirls.  Its eyes are like that",
                "of a cat and seem to glow slightly.  This tapestry is titled, \"Iorich, the",
                "Silent Hunter.\"  To the south is the east entrance to the marketplace and a",
                "staircase is just a bit north.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32267",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32268"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32253"
                }
            },
            "extras": {}
        },
        "32292": {
            "name": "{YS{yeventh {YG{yuest {YR{yoom{x",
            "description": [
                "Like the guest room on the opposite side of the castle, a small table",
                "rests between this door and the sixth guest room.  Two torches are on either",
                "side of the doors used for illuminating the hallway during the dark nights. ",
                "Through the window you can see a rather strange structure to the east of the",
                "crop fields.  It looks to be a levitated fountain of sorts with no apparent",
                "source for where the water is coming from.  From there, the water travels",
                "down a small aqueduct to irrigate the fields.  With what you've seen so far,",
                "you wouldn't be surprised if Lord Morrolan has devised a way to create a",
                "permanent magical spring.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32292",
            "exits": {
                "south": {
                    "flags_raw": "32298",
                    "description": [
                        ""
                    ],
                    "room_id": "32297"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32291"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32293"
                }
            },
            "extras": {}
        },
        "32207": {
            "name": "{RB{refore {Rt{rhe {RR{red {RH{raze{x",
            "description": [
                "Only some ten or fifteen meters from the heat source, the humidity",
                "and heat in the ravine feels as though it has doubled, easily in the",
                "hundreds.  Amidst the hazy redness, a black sliver can bee seen",
                "splitting it through the middle.  You can no longer see the mountain",
                "and resting place of Castle Black, nor can you see the silvery line",
                "that leads to the floating fortress.  Steam and fumes surround you",
                "now, making it difficult to much of anything.  Only the red glow in",
                "front of you tells you you're going in the right--or wrong, depending",
                "on your view of things--direction.  "
            ],
            "flags_raw": "0 0 0 10",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32207",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32206"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32208"
                }
            },
            "extras": {}
        },
        "32258": {
            "name": "{YM{yainstreet{x",
            "description": [
                "The beautiful fountain is just to the east.  To the south is Aliera's",
                "Magic Emporium and the wonderful smell of fresh baked bread is coming from",
                "the north.  The Golden Roll, it's called, has various forms of bread",
                "displayed in the window.  Round bread with cheese topped on it, long loaves",
                "with cuts in the top, and some small cakes.  "
            ],
            "flags_raw": "0 0 0 21",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32258",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32249"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32263"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32259"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32257"
                }
            },
            "extras": {}
        },
        "32265": {
            "name": "{YT{yhe {RI{rron {RF{rorge {YA{yrmory{x",
            "description": [
                "This building would be unbearably hot if it weren't for the two doors",
                "that are always remain open.  A huge smelting furnace is in the back which",
                "the armory and weaponry share accompanied by two large anvils and water",
                "trough.  The walls of store are decorated by various pieces of armor, all ",
                "of incredible make and design.  This part of the store is managed by Roen,",
                "Grizwald's assistant."
            ],
            "flags_raw": "0 8 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32265",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32256"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32264"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32266"
                }
            },
            "extras": {}
        },
        "32200": {
            "name": "{GB{greak {GI{gn {Gt{ghe {GF{gorest{x",
            "description": [
                "After travelling a while north, it seems you've found a break in",
                "the forest.  The path you've been following leads to an opening,",
                "through which blinding white light pours through it.  The light stings",
                "your now-sensitive eyes and any attempt at shielding them short of",
                "closing your eyes won't help.  The light seems to be comming from",
                "every direction, especially the floor in front of you.  What could be",
                "causing all this light?  Only one way to find out.  "
            ],
            "flags_raw": "0 0 0 3",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32200",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32301"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32201"
                }
            },
            "extras": {}
        },
        "32231": {
            "name": "{YT{yangerine {GT{gree {GW{gith {YDaffodils",
            "description": [
                "The sweet citrus aroma that was so pleasant does not exist here.  The",
                "light breeze has stopped.  The tangerine tree is near dead and the dafadils",
                "lay black and wasted at the base of the tree.  The tangerines on the tree",
                "are withered, hard, and dried out.  What used to be soft grass that you",
                "walked on throughout the orchard is now brown and dried out here.  Strangly",
                "enough, the smell of death comes from the tree, instead of the sweet smell",
                "of tangerines.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32231",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32230"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32229"
                }
            },
            "extras": {}
        },
        "32225": {
            "name": "{YO{yrange {GT{gree {GW{gith {YPoppies{x",
            "description": [
                "Bright orange poppies hug the trunk of the orange tree.  Oddly enough,",
                "these poppies seem to have the same color as the oranges that grow above",
                "them.  Instead of a deep golden orange, these poppies have a lighter and",
                "much brighter orange to them.  Taking a quick sniff, the orange poppies even",
                "smell a little like oranges.  It's probably due to the occasional orange",
                "that falls to the ground.  One must of them must have landed and maybe even",
                "leaked its juice over all these poppies.  Still, it's kind of strange.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32225",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32220"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32224"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32218"
                }
            },
            "extras": {}
        },
        "32274": {
            "name": "{WN{worth {WW{west {WC{worner{x",
            "description": [
                "You have reached the north west corner of the castle.  Another staircase",
                "is here in the center of the floor as well as a another table with a potted",
                "fern.  A warm air can be felt from the east as well as the scent of an ocean",
                "breeze.  To your south are a few more tapestries and the west entrance to",
                "the marketplace.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32274",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32261"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32273"
                },
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32289"
                }
            },
            "extras": {}
        },
        "32210": {
            "name": "{RD{reeper {RD{rown {Rt{rhe {RC{rhasm{x",
            "description": [
                "The fumes and heat have cleared mostly at this distance, and now",
                "you can get quite a clear view of both the mountain and the silvery",
                "glint leading to Castle Black.  The glinting appears to be some sort",
                "of silvery line, touching the ground, then running up several hundred",
                "feet to the edge of the mountain.  You're best guess as to what it",
                "would be used for is a guide-line for those who wish to fly up to the",
                "mountain.  In the distance, you can see something protruding from the",
                "ground.  It has a long slender part at the bottom and a rectangular",
                "section attached to the top.  Some indecipherable markings seem to be",
                "painted on this thing, you guess it's unreadable due to the distance",
                "from where you stand.  While thinking about it for a while, a word",
                "finally comes to mind.  Ah, yes...  A sign.  "
            ],
            "flags_raw": "0 0 0 2",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32210",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32209"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32211"
                }
            },
            "extras": {}
        },
        "32218": {
            "name": "{YT{yhe {GO{grchard {GP{gath{x",
            "description": [
                "You are taken back by the strong aroma that fills the air.  The sweet",
                "smell of ripe citrus fruits fills the air; occasionally enhanced by a light",
                "breeze.  To your left and right are a pair of orange trees on either side. ",
                "Behind those is a pair of lemon trees, and behind the lemon trees are a pair",
                "of tangerine trees.  At the base of each tree is a circle of flowers.  Some",
                "have violets, some with orchids, others with a ring of roses, all",
                "contribuiting to the incredible fragrance.  A small fence encompasses the",
                "entire orchard.  "
            ],
            "flags_raw": "0 0 0 11",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32218",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32217"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32219"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32225"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32227"
                }
            },
            "extras": {}
        },
        "32239": {
            "name": "{WT{wop {Wo{wf {Wt{whe {WS{wtaircase{x",
            "description": [
                "The stairs have risen a total of around ten feet.  At the top of the",
                "stairs there are two more paintings The painting on the left is a handsome",
                "fellow in his late twenties or early thirties.  His expression is that of",
                "caution, his black eyes wide open and his mouth slightly ajar.  What looks",
                "to be a miniature gold dragon sits on his shoulder, its muzzle rested inside",
                "the man's curly brown hair.  The young man wields a throwing knife, held in",
                "his right hand, which is missing the pinkie.  A leather patch covers the",
                "right side of his hand, looped round his ring finger and tied off at the",
                "wrist.  On the right side of the hallway is the other painting, a picture of",
                "a shapely woman in a silk outfit that outlines every part of her body.  It",
                "looks as though she is attempting to sneak in this picture, wearing black",
                "slippers as well as a fine black cloak around her body.  She has green eyes,",
                "like that of the pale of woman, her facial features are very similar, but",
                "with curly brown hair instead of the long, straight, black hair.  Underneath",
                "the painting of the young man is the name \"Taltos\" and beneath the picture",
                "of the woman is the name, \"Kiera.\"  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32239",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32240"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32236"
                }
            },
            "extras": {}
        },
        "32229": {
            "name": "{YLemon {GT{gree {GW{gith {MP{mansies{x",
            "description": [
                "Although sweet, the air here doesn't seem quite as strong as other places",
                "in the orchard.  The light breeze that seemed to be always constant has",
                "almost stopped, only with the occasional very light gust.  There are some",
                "lavender pansies that grow here, but they seem to rather wilted.  Why would",
                "Lord Morrolan take so much care for his other trees, but not the ones on",
                "this side?  Although the other lemon tree and the orange trees seem to be",
                "growing fine, flourishing in fact, this one's lemons aren't quite as big or",
                "smell quite as sweet.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32229",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32228"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32227"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32231"
                }
            },
            "extras": {}
        },
        "32202": {
            "name": "{WA{wlong {Wt{whe {WB{wroken {WP{wath{x",
            "description": [
                "A large shadow covers you, temporarily protecting you from the",
                "blinding light and heat reflected from the sparkling ground. ",
                "Positioning yourself right, you manage to keep the soothing shade on",
                "you for a while longer and able to take in the fullness of the area",
                "around you.  As far as you can see, what used to be dunes of sand,",
                "windswept and full of desert life.  The dunes are no longer sand, they",
                "are smooth, slick, mounds of glass.  In various parts of the glassy",
                "dunes, gas pockets have shaped and moulded the glass into giant,",
                "fragile bubbles.  The gasses swirl in entrancing motions and at times",
                "the gas ignites, flaring up and illuminating the glass bubbles. ",
                "Thousands of these bulbs (no doubt millions when considering the size",
                "of a desert) flare up in what seems to be an orchestra of lights.  At",
                "night, this place would be even more spectacular.  You doubt if Talos",
                "had intended on creating such a beautiful display.  "
            ],
            "flags_raw": "0 0 0 2",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32202",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32201"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32203"
                }
            },
            "extras": {}
        },
        "32214": {
            "name": "{WH{wigh {Wi{wn {Wt{whe {BS{bky{x",
            "description": [
                "Who would have thought one hundred feet would make all the difference. ",
                "The wind is roaring past you as you hold onto the Silver Cord with a",
                "death-like grip.  Even if you shouted at the top of your lungs, you still",
                "wouldn't be able to hear your own voice.  Strangely enough, what trees you",
                "are able to see that lay on top of the mountain are motionless, save for the",
                "occasional light breeze.  It looks as though a permanent, yet localized,",
                "control weather spell has been placed on the entire mountain.  The Lord",
                "Morrolan must indeed be powerful to control such magic.  Indeed, to levitate",
                "an entire mountain would require such a feat of magic you can only marvel at",
                "the sheer power this man may hold.  "
            ],
            "flags_raw": "0 0 0 9",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32214",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32215"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32213"
                }
            },
            "extras": {}
        },
        "32238": {
            "name": "{WT{whe {WS{wtudy{x",
            "description": [
                "A very elegant study.  Books line all four walls of the room with only a",
                "small break for the door.  Two overstuffed chairs are in the center of the",
                "room, faced at an angle to each other with a small coffee table between",
                "them.  There are a couple desks behind the chairs, each with a pile of",
                "paper, an ink blotter, and a quill.  Candle holders are clamped in place on",
                "the sides of the tables for late night studiers.  During the daytime, this",
                "room is filled with sunlight through the stained glass ceiling.  The stained",
                "glass makes up a giant picture of the pale woman you saw in the hallway",
                "painting.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32238",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32236"
                }
            },
            "extras": {}
        },
        "32282": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32282",
            "exits": {
                "south": {
                    "flags_raw": "32292",
                    "description": [
                        ""
                    ],
                    "room_id": "32276"
                }
            },
            "extras": {}
        },
        "32242": {
            "name": "{WS{wouth {WW{west {WW{wall{x",
            "description": [
                "You are inside the south west wall.  This wall has a tapestry of what",
                "looks like a giant foo lion with a central horn in it's head.  The beast has",
                "a large mane and howls towards the sky in a grassy plain.  Other animals of",
                "this kind look as though they are circling around the central one.  At the",
                "bottom of the tapestry is the phrase, \"Lyorns in the Summer.\"  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32242",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32241"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32243"
                }
            },
            "extras": {}
        },
        "32273": {
            "name": "{WN{worth {WW{west {WW{wall{x",
            "description": [
                "This wall most definitely has the most incredible tapestry of them all. ",
                "Opposite to the orca painting, a warm air radiates from this picture.  The",
                "tapestry is a picture of a phoenix being born, rising from the ashes in all",
                "its glory.  Flames whip about the phoenix as it raises its head towards the",
                "sky and spreads its wings in the epic display of creation.  A most",
                "incredible picture.  You could almost swear that the flames were actually",
                "moving in this tapestry.  At the bottom of the tappestry it says, \"And From",
                "the Ashes Gray, I rise.\"  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32273",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32274"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32272"
                }
            },
            "extras": {}
        },
        "32294": {
            "name": "{WN{worth {WE{wast {WS{wtaircase{x",
            "description": [
                "With a brisk walk, you've reached the north east staircase.  To your",
                "south is the south east staircase as well as some very extravagant oil",
                "paintings.  In fact, a small shimmer of light seems to be coming from one of",
                "the paintings, reflecting the torch light from the wall.  To your west are",
                "rooms five through eight and a more windows through which you can get some",
                "views of the surrounding area.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32294",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32293"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32288"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32268"
                }
            },
            "extras": {}
        },
        "32248": {
            "name": "{GA{gliera's {BM{bagic {YE{ymporium{x",
            "description": [
                "This is an extraordinary magic shop.  Magical bags, containers, wands,",
                "staves, and all sorts interesting magical objects are on display behind",
                "glass cases.  Aliera has quite the collection here, and this isn't even the",
                "half of it.  There is also potion and scroll shop to add to her already",
                "impressive supply.  These items are very expensive, but worth every penny of",
                "it.  "
            ],
            "flags_raw": "0 12 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32248",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32259"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32249"
                }
            },
            "extras": {}
        },
        "32250": {
            "name": "{WS{wouth {YM{yarketplace {WE{wntrance{x",
            "description": [
                "This is the southern entrance to the marketplace of Castle Black.  There",
                "are two doors on either side of you.  On the west door there is a symbol of",
                "a potion with the a small metal plaque above it that says, \"Aliera's",
                "Potions\".  To the east is another door with a picture of a book clustered",
                "together with scrolls and a feather quill.  This is the door to \"Aliera's",
                "Scrolls\".  That incredible fountain is to the north.  "
            ],
            "flags_raw": "0 0 0 21",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32250",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32240"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32257"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32249"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32251"
                }
            },
            "extras": {}
        },
        "32205": {
            "name": "{CB{cottom {Co{cf {Ct{che {CS{ctaircase{x",
            "description": [
                "You've reached the bottom of the staircase.  Here, the walls of the",
                "chasm are solid black, seemingly made from pure obsidian.  Your own",
                "reflection can be seen clearly off the many facets that glisten at",
                "every angle from the wall and floor.  At this level, you notice a",
                "definite change in temperature.  Instead of being cooler from being",
                "out of the direct sun light and the reflective Plains, it actually",
                "hotter and very humid.  The heat seems to be comming from the red haze",
                "that glows in the distance.  Even more remarkably, you notice that is",
                "absolutely no trace of dust or dirt where you stand, aside from the",
                "dirt you brought with you.  It's almost as if someone is taking great",
                "care in keeping this place clean and sparkling.  "
            ],
            "flags_raw": "0 0 0 5",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32205",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32206"
                },
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32204"
                }
            },
            "extras": {}
        },
        "32283": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32283",
            "exits": {
                "south": {
                    "flags_raw": "32293",
                    "description": [
                        ""
                    ],
                    "room_id": "32277"
                }
            },
            "extras": {}
        },
        "32240": {
            "name": "{WB{wefore {Wt{whe {YM{yarketplace{x",
            "description": [
                "You stand before the marketplace of Castle Black.  The walkway has turned",
                "from the smooth marble back to the cobblestone.  It's a small marketplace,",
                "but then again it's inside a castle.  Considering the castles location and",
                "the dark rumors often passed about Lord Morrolan, you doubt this place gets",
                "much business and it's more for the comfort of the people who take temporary",
                "residence here.  There is a large, cone-shaped fountain in the center,",
                "glistening with crystalline water.  The hallway splits to the left and right",
                "leading through the castle walls.  The cobble stone path goes onward into",
                "the marketplace.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32240",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32239"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32250"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32243"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32244"
                }
            },
            "extras": {}
        },
        "32257": {
            "name": "{YM{yarket {YS{yquare{x",
            "description": [
                "Magnificent!  An incredible fountain occupies the center of the market",
                "square.  The fountain is cone shaped with small ripples, causing a beautiful",
                "display of rippling water.  When it reaches the edge of the fountain, it",
                "beads and rolls beneath the base of the fountain and drips into a small",
                "pond.  The water is clearer than crystal with a tint of teal to it.  "
            ],
            "flags_raw": "0 0 0 21",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32257",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32250"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32264"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32258"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32256"
                }
            },
            "extras": {}
        },
        "32213": {
            "name": "{WH{wigher {WU{wp {Wt{whe {WS{wilver {WC{word{x",
            "description": [
                "From this height, you can clearly see where you are.  The apparent portal",
                "you stepped through has taken you far across the continent and placed you",
                "near the Sea of Swords.  It appears the Glass Plains were much like the",
                "Sands of Sorrow at once point in history.  In fact, from what you can see,",
                "the Sands of Sorrow are just to the north of you across a small body of",
                "water.  To your southwest is an enormous forest, and farther to the west are",
                "the mountains that ring the Elemental Canyon.  Almost swept off your guard,",
                "the wind has really started to pick up.  A couple more hundred feet and you",
                "will have reached the mountain.  "
            ],
            "flags_raw": "0 4 0 9",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32213",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32214"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32212"
                }
            },
            "extras": {}
        },
        "32295": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32295",
            "exits": {
                "north": {
                    "flags_raw": "32296",
                    "description": [
                        ""
                    ],
                    "room_id": "32290"
                }
            },
            "extras": {}
        },
        "32206": {
            "name": "{CA{clong {Ct{che {RR{ravine{x",
            "description": [
                "Moving closer to the wavy red haze, the heat is really starting to",
                "pick up.  It's only a few hundred feet from you now, but it feels as",
                "though every foot you take makes a difference.  Aside from the heat,",
                "you can only marvel at the glassy walls of the ravine.  It's strange",
                "how the glass has formed in this area, jutting outwards in every",
                "direction like crystals.  Even the obsidian has taken on this",
                "crystaline shape, making for a very strange albeit beautiful display. ",
                "You've never seen glass or obsidian is these kinds of formations,",
                "short of dwarven carvings and artwork.  Where you stand, the",
                "formations are small or none at all.  They get larger and more",
                "extravagant as you near what you presume to be the source of all the",
                "heat.  "
            ],
            "flags_raw": "0 0 0 2",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32206",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32205"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32207"
                }
            },
            "extras": {}
        },
        "32241": {
            "name": "{WS{wouth {WW{west {WC{worner{x",
            "description": [
                "This is the south west corner of the castle walls.  The hallway branches",
                "to the north and to the east.  A remarkable spiral staircase made from",
                "marble and with no central support leads to the residential level of the",
                "castle.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32241",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32247"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32242"
                },
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32275"
                }
            },
            "extras": {}
        },
        "32275": {
            "name": "{WS{wouth {WW{west {WS{wtaircase{x",
            "description": [
                "This is the south west staircase.  The stairs lead down to the first",
                "level of the castle and the tapestries.  Guest quarters one through four are",
                "to the east and some painting line the walls to the north.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32275",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32281"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32276"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32241"
                }
            },
            "extras": {}
        },
        "32259": {
            "name": "{WW{west {YM{yainstreet{x",
            "description": [
                "You are on Western Mainstreet, just north of Aliera's Magic Emporium and",
                "south of Mordmorgan's Common Appliances.  A few more stores are located just",
                "a ways down the street from you, Aliera's Potions, her scroll shop, the Iron",
                "Forge, and a magic jewelry shop.  The cobble stone road is very well taken",
                "care of and glistens under the sunlight.  "
            ],
            "flags_raw": "0 0 0 21",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32259",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32248"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32262"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32260"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32258"
                }
            },
            "extras": {}
        },
        "32253": {
            "name": "{WE{wast {YM{yarketplace {WE{wntrance{x",
            "description": [
                "This is the eastern entrance to the marketplace.  To the west is the",
                "jewelry and weapon shop.  To the north and south fabulous tapestries hang on",
                "the walls, and around the corner you suspect there are even more.  A small",
                "half-table is against the wall with a potted fern hanging over it and",
                "touching the ground.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32253",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32267"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32255"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32254"
                }
            },
            "extras": {}
        },
        "32212": {
            "name": "{WA{wlong {Wt{whe {WS{wilver {WC{word{x",
            "description": [
                "The wind is relatively strong here, and the Silver Cord doesn't supply",
                "very much assistance.  Looking farther up, though, you can see clouds racing",
                "by, swirling and tumbling as they are tormented and beaten by the ferocious",
                "wind.  The Silver Cord sways in the distance, but not by much for the cord",
                "is stiff and strong as a rod of steel.  Down below you, some one hundred",
                "feet or so, you can just barely see the sign you left behind.  If flying",
                "abilities should fail at this height, it will be a long trip down to a short",
                "death.  All in all, the cool wind feels good compared that treacherous heat."
            ],
            "flags_raw": "0 0 0 9",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32212",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32213"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32211"
                }
            },
            "extras": {}
        },
        "32264": {
            "name": "{WN{worth {YM{yainstreet{x",
            "description": [
                "As you walk down North Mainstreet, the smell of fresh baked breads comes",
                "at you from the west.  From the looks of the display in the window, this",
                "place must sell every type of bread you could think of.  To the east is the",
                "Iron Forge Armory, which is one of two parts to the Iron Forge.  You'll find",
                "the Iron Forge Weaponry on East Mainstreet, or you can go there through the",
                "armory.  "
            ],
            "flags_raw": "0 0 0 21",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32264",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32257"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32271"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32263"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32265"
                }
            },
            "extras": {}
        },
        "32255": {
            "name": "{WE{wast {YM{yainstreet{x",
            "description": [
                "This is East Mainstreet, although it's not much of a street; just long",
                "enough to fit eight shops.  To your south is the Magic Sapphire, a shop that",
                "sells magical jewelry.  To the north is the Iron Forge Weaponry, a weapon",
                "shop specializing in various forms of magic weaponry.  Its counterpart, the",
                "Iron Forge Armory, is, as you might guess, a shop for selling magic armor.  "
            ],
            "flags_raw": "0 0 0 21",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32255",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32252"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32266"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32256"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32253"
                }
            },
            "extras": {}
        },
        "32263": {
            "name": "{yThe {YGolden {yRoll{x",
            "description": [
                "The sweet aroma of fresh baked bread fills your nose.  A very large chef",
                "runs around the bakery gathering different items to make all his different",
                "kinds of bread.  The room itself is filled with tons of bread: large loaves,",
                "long loaves, loaves of bread made with peppers, some with cheese, some with",
                "honey, and even one made with crab meat called \"Waybread.\"  You never knew",
                "bread could be made in so many different ways.  "
            ],
            "flags_raw": "0 8 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32263",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32258"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32264"
                }
            },
            "extras": {}
        },
        "32268": {
            "name": "{WN{worth {WE{wast {WC{worner{x",
            "description": [
                "This is the north east corner of the castle.  A small table is back",
                "against the corner of the wall supporting the small potted plant that lay on",
                "top of it.  In the center of floor is a spiraling staircase that leads to",
                "the guest quarters of the castle.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32268",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32269"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32267"
                },
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32294"
                }
            },
            "extras": {}
        },
        "32302": {
            "name": "{DInside {Ct{che {YT{yree{x",
            "description": [
                "The smell, the sight, yes, the utter feeling of death permeates every fiber of this tree.",
                " -to finish later"
            ],
            "flags_raw": "0 0 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32302",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32303"
                }
            },
            "extras": {}
        },
        "32277": {
            "name": "{YS{yecond {YG{yuest {YR{yoom{x",
            "description": [
                "This is the door to the second guest room.  To the right of the door",
                "between this and the next one is a small table with a mirror above it. ",
                "Another window is behind you through which you can see the entire orchard.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32277",
            "exits": {
                "north": {
                    "flags_raw": "32293",
                    "description": [
                        ""
                    ],
                    "room_id": "32283"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32276"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32278"
                }
            },
            "extras": {}
        },
        "32245": {
            "name": "{WS{wouth {WE{wast {WW{wall{x",
            "description": [
                "Ah, something you recognize.  A hawk soars low to a body of water, the",
                "very tips of its wings brushing the water.  Rippling rings of water trail",
                "behind the bird in its graceful flight.  Beyond the water, green pines line",
                "the edge with snow capped mountains towering above them.  A cool air seems",
                "to radiate from this tapestry, and you can almost feel the chill of the",
                "mountain air in the picture.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32245",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32244"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32246"
                }
            },
            "extras": {}
        },
        "32266": {
            "name": "{YT{yhe {RI{rron {RF{rorge {YW{yeaponry{x",
            "description": [
                "This shop is managed by Grizwald, the master weapon smith of Castle",
                "Black.  He has devoted his art to creating weapons for beginning",
                "adventurers.  His shop is lined with various weapons covering every",
                "fighting style.  Grizwald has crafted weapons for use with every class",
                "in mind.  Behind the counter, shared with the armory, is a giant",
                "smelter, a cooling trough, and two anvils."
            ],
            "flags_raw": "0 8 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32266",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32265"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32255"
                }
            },
            "extras": {}
        },
        "32278": {
            "name": "{YT{yhird {YG{yuest {YR{yoom{x",
            "description": [
                "Through the window in front of the third guest room you can see the",
                "bronze statue of Lord Morrolan.  It glistens in the light along with the",
                "cobble stone pathway that goes around it.  "
            ],
            "flags_raw": "0 0 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32278",
            "exits": {
                "north": {
                    "flags_raw": "32294",
                    "description": [
                        ""
                    ],
                    "room_id": "32284"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32277"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32279"
                }
            },
            "extras": {}
        },
        "32287": {
            "name": "{WN{worth {WW{west {YH{yallway{x",
            "description": [
                "On this wall is a rather silly painting.  It's a picture of two of those",
                "little gold dragons curled up together next to a fireplace.  At the bottom",
                "of the picture it says, \"Rocza and Loiosh Hard at Work.\"  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32287",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32289"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32281"
                }
            },
            "extras": {}
        },
        "32226": {
            "name": "{YO{yrange {GT{gree {GW{gith {WG{wa{Wr{wd{Wi{wn{Wi{wa{Ws{x",
            "description": [
                "Plump oranges hang over a group of white Gardinias, carefully placed",
                "around the tree.  As an orange falls to the ground into the bunch of",
                "flowers, a puff of glitter-like pollen shoots into the air.  It sparkles as",
                "it falls back to the ground.  The wire fence begins again on this side, goes",
                "for another two trees then heads south.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32226",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32227"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32219"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32228"
                }
            },
            "extras": {}
        },
        "32299": {
            "name": "{WC{8astle {yB{ca{yttl{ce{ym{ce{ynt{x",
            "description": [
                "This lone vantage point looks out over the whole of Castle Black. ",
                "Not much to see passed the walls--clouds and the occasional",
                "mountaintop, maybe some birds but that's about it.  "
            ],
            "flags_raw": "0 201326596 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32299",
            "exits": {
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32257"
                }
            },
            "extras": {}
        },
        "32243": {
            "name": "{WS{wouth {WW{wall{x",
            "description": [
                "You are just west of the staircase and southern entrance to the",
                "marketplace.  On the wall is a large tapestry depicting a red dragon atop a",
                "snowy mountain peak.  He's breathing a cone of fire into the air with his",
                "wings outstretched and claws reaching upwards.  A remarkable piece of work. "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32243",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32242"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32240"
                }
            },
            "extras": {}
        },
        "32230": {
            "name": "{YT{yangerine {GT{gree {GW{gith {BH{bydrangeas{x",
            "description": [
                "Hydrangeas; an interesting name for a flower.  You wouldn't have even",
                "guessed at the name of this flower if it weren't for the little flag",
                "sticking out of the ground with its name on it.  It looks as though Lord",
                "Morrolan is at least trying to take care of his orchard, but these flowers",
                "look almost dead.  They look as though they were a deep blue at one time,",
                "but now they are near to black and barely holding on.  The ground has been",
                "freshly turned and watered, but they still don't seem to be doing well.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32230",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32228"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32231"
                }
            },
            "extras": {}
        },
        "32290": {
            "name": "{YF{yifth {YG{yuest {YR{yoom{x",
            "description": [
                "Through the window in front of the guest room, you get a much better view",
                "of the Glass Plains.  Of in the distance you can see the ocean waves",
                "crashing against the sparkling shore.  Not like the glassy mainland, the",
                "shore of the Glass Plains is made of sand which sparkles and gleams off in",
                "the distance.  You wonder if you would cut your feet on that sand, or if it",
                "would be like a fine powder.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32290",
            "exits": {
                "south": {
                    "flags_raw": "32296",
                    "description": [
                        ""
                    ],
                    "room_id": "32295"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32289"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32291"
                }
            },
            "extras": {}
        },
        "32289": {
            "name": "{WN{worth {WW{west {WS{wtaircase{x",
            "description": [
                "A marble spiraling staircase leads down to the first level of the castle.",
                "On the wall in the corner hangs a medallion encased behind a glass display. ",
                "You don't know the significance of it, other than it is a very beautiful",
                "piece of jewelry.  From you can discern, it's probably something of",
                "sentimental value to Lord Morrolan.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32289",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32287"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32290"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32274"
                }
            },
            "extras": {}
        },
        "32236": {
            "name": "{WH{walfway {Wu{wp {Wt{whe {WS{wtaircase{x",
            "description": [
                "The two doors you saw earlier in the foyer ore on either side of you now.",
                "The silver drawings on the doors are in fact some kind of magical runes. ",
                "They glow with powerful magic, but this must be a long forgotten or foreign",
                "art because these do not look anything like the common arcane language",
                "spoken by spell casters.  Above the door on the left, carved into the stone",
                "are the words, \"His Lordship, Morrolan the Black\".  Over the left door is",
                "the picture of an open book with an ink bottle and quill next to it.  Two",
                "more paintings are mounted on the walls a little ways more up the staircase."
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32236",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32235"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32239"
                },
                "west": {
                    "flags_raw": "32239",
                    "description": [
                        ""
                    ],
                    "room_id": "32237"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32238"
                }
            },
            "extras": {}
        },
        "32204": {
            "name": "{CO{cn {Ct{che {CS{ctaircase{x",
            "description": [
                "The luminous shadow cast by the floating mountain still covers the",
                "area, providing temporary relief.  Off in the distance you catch a",
                "glint of light, a silvery stream of light that makes it way to the top",
                "of the mountain.  It is impossible to make out exactly what it is, but",
                "only distance will tell.  Then you notice a red haze down below in the",
                "chasm.  It seems to waver like a wet cobble road on a hot day, as if a",
                "red steam were rising out of the earth.  Could this be one of the",
                "rivers of fire left over from Talos's rage?  The staircase continues",
                "down a few more steps if you care to take a look, but even those few",
                "steps is quite the hike.  "
            ],
            "flags_raw": "0 0 0 5",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32204",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32203"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32205"
                }
            },
            "extras": {}
        },
        "32276": {
            "name": "{YF{yirst {YG{yuest {YR{yoom{x",
            "description": [
                "You stand before the first guest room.  On either side of the door is a",
                "torch and a window behind you.  Through the window you can see the edge of",
                "the floating island, the clouds swirling all about but never moving onto",
                "land.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32276",
            "exits": {
                "north": {
                    "flags_raw": "32292",
                    "description": [
                        ""
                    ],
                    "room_id": "32282"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32275"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32277"
                }
            },
            "extras": {}
        },
        "32215": {
            "name": "{BA{btop {Bt{bhe {YS{yilver {YC{yord{x",
            "description": [
                "Just before you reach the top, your legs dangle horizontally as the",
                "wind rushes past you.  With your eyes watering you blinding pull",
                "yourself up the Silver Cord.  Upon reaching the top, the wind suddenly",
                "stops.  Silence.  Your ears are now in a constant ring from the wind",
                "constantly rushing past your ears.  After a few brief moments, the",
                "ringing begins to subside.  Another 10 feet and you'll be safely on",
                "the edge of the mountain.  After taking a few minutes to catch your",
                "breath and letting your ears take it easy, all that wind begins to",
                "make perfect sense.  What better way to prevent an aerial assault on",
                "your castle than to make it nearly impossible for any flying creature",
                "to fly.  Even Tchazzar would not be able to navigate through these",
                "winds.  Safe from ground troops and large flying critters, the only",
                "people capable of an assault on Castle Black would be spell casters,",
                "and from the magic it must have taken to make such a fortress as this,",
                "any assault would be suicide.  "
            ],
            "flags_raw": "0 0 0 11",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32215",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32216"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32214"
                }
            },
            "extras": {}
        },
        "32228": {
            "name": "{YLemon {MT{mree {MWith {WI{wr{Wi{ws{Wi{ws{x",
            "description": [
                "Irisis of every different color occupy the ground here.  Lavender, pink,",
                "and white, making for an extraordinary display.  Looking at the trunk of the",
                "lemon tree, you notice that some of the irisis have found a rather nice home",
                "on the tree.  Some of the moss that lines the pathway has grown on the tree",
                "and made it stable enough for the irisis to plant themselves.  They have not",
                "only grown on the trunk, but all over the tree.  They don't seem to be",
                "hurting the tree at all, for it's still producing large and sour-sweet",
                "lemons.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32228",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32229"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32226"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32230"
                }
            },
            "extras": {}
        },
        "32217": {
            "name": "{YO{yn {Yt{yhe {YC{yobble {YS{ytone {YP{yath{x",
            "description": [
                "The cobble stones on the path are maintained very well, glistening in the",
                "sun.  A large brilliant shell takes place of the occasional stone,",
                "illuminating the pathway.  At night, these reflective shells would seem to",
                "enhance the moonlight and make the path visible.  Not far ahead you can see",
                "a small orchard of trees, blooming with plump, juicy, delicious looking",
                "fruits.  Oranges, lemons, and tangerines litter the ground, releasing a",
                "sweet aroma into the air.  The cobble path goes right through the middle of",
                "the orchard on up to two very large black doors.  "
            ],
            "flags_raw": "0 4 0 11",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32217",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32218"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32216"
                }
            },
            "extras": {}
        },
        "32256": {
            "name": "{YM{yainstreet{x",
            "description": [
                "To the north and south are two more shops, Aliera's Scrolls and the",
                "armory of the Iron Forge.  Griswald, the master smithy of Castle Black,",
                "creates armor and weapons both enchanted with light and strong magic to",
                "accommodate for the various levels of skill.  "
            ],
            "flags_raw": "0 0 0 21",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32256",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32251"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32265"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32257"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32255"
                }
            },
            "extras": {}
        },
        "32246": {
            "name": "{WS{wouth {WE{wast {WC{worner{x",
            "description": [
                "This is the south east corner of the castle.  Like the south west corner,",
                "a spiralling staircase leads up to the second floor of the castle.  The",
                "hallways continues north and west, both hallways lined with magnificant",
                "tapestries.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32246",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32254"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32245"
                },
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32280"
                }
            },
            "extras": {}
        },
        "32272": {
            "name": "{WN{worth {WW{wall{x",
            "description": [
                "The smell of salty air seems to come from this tapestry, as though you",
                "were standing on the beach.  Looking at this tapestry is almost like looking",
                "out of a window into the ocean.  Schools of fish, the sandy ocean bottom,",
                "coral, and all sorts of marine life can be seen, but the tapestry seems to",
                "be focusing on one marine animal in particular, the orca whale.  There are",
                "two whales crisscrossing each other halfway in the air with a third coming",
                "over head.  This spectacular scene displays the whales' agility and sheer",
                "strength to heave it self out of the water, especially at that height.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32272",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32273"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32271"
                }
            },
            "extras": {}
        },
        "32297": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32297",
            "exits": {
                "north": {
                    "flags_raw": "32298",
                    "description": [
                        ""
                    ],
                    "room_id": "32292"
                }
            },
            "extras": {}
        },
        "32232": {
            "name": "{WC{wastle {WB{wlack{x",
            "description": [
                "Made of pure obsidian or highly polished black marble, Castle Black looms",
                "before you.  A stone archway with intricate angelic carvings stands between",
                "you and the castle.  At a closer look, the carvings are not stationary but",
                "swim along the surface of the archway as if it were made of water.  A rather",
                "spooky addition to an already gloomy castle.  So far, this place doesn't",
                "seem very inviting.  "
            ],
            "flags_raw": "0 0 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32232",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32233"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32219"
                }
            },
            "extras": {}
        },
        "32234": {
            "name": "{WT{whe {WF{woyer{x",
            "description": [
                "You stand in the foyer of Castle Black, two elegant chairs are on either",
                "side of you.  Between both chairs is a small table and a vase filled with",
                "assorted flowers, you assume they are from the orchard.  The foyer it self",
                "is fifteen feet by twenty feet, and not at all as dark and gloomy as you",
                "thought it would be.  A chandelier blossoming with bright candles hangs",
                "above you, keeping the foyer nice and bright.  Beyond the foyer, a long",
                "staircase leads to a small marketplace held within the walls.  The staircase",
                "is shallow and easygoing to accommodate for the various races that visit the",
                "castle.  After twenty feet or so, there are two doors on the east and west",
                "walls, both of which are covered in delicate silver drawings, as well as",
                "what might be arcane runes.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32234",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32235"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32233"
                }
            },
            "extras": {}
        },
        "32249": {
            "name": "{GA{gliera's {CP{cotions{x",
            "description": [
                "Bottles, vials, and beakers are all over the place, displayed on shelves",
                "that cover from wall to wall.  Black ones, blue ones, red ones, they all",
                "bubble and glow with special magics.  You could find just about any type of",
                "potion you wish in here.  Aliera has quite the collection, the potions",
                "originating from all over the Realms.  An assistant of hers tends to the",
                "customers.  "
            ],
            "flags_raw": "0 8 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32249",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32258"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32248"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32250"
                }
            },
            "extras": {}
        },
        "32252": {
            "name": "{MT{mhe {CM{cagic {BS{bapphire{x",
            "description": [
                "This is a shop where magical jewelry of all sorts can be purchased. ",
                "Earrings, bracelets, anklets, rings, and the sort can be seen on display in",
                "fancy jewelry cases.  They are made of precious metals and gemstones, some",
                "of them made from gems and metals you've never seen before.  Nonetheless,",
                "they are all very well crafted and quite beautiful.  "
            ],
            "flags_raw": "0 8 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32252",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32255"
                }
            },
            "extras": {}
        },
        "32261": {
            "name": "{WW{west {WW{wall{x",
            "description": [
                "On this wall is a remarkable painting what you guess to be some sort of",
                "spell caster performing a spell in front of a small golden dragon.  The",
                "dragon looks like the one on the Taltos oil painting, as well as the mage",
                "performing the spell.  The dragon is curled around an egg, and at the bottom",
                "of the tapestry it says, \"I offer it long life...  And I offer it my",
                "friendship.\"  Beneath that, is a single italicized word, \"Jhereg.\"  The",
                "western entrance to the marketplace is south of you and the northwest",
                "staircase is to the north.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32261",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32274"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32260"
                }
            },
            "extras": {}
        },
        "32305": {
            "name": "{WT{whe {BR{boot {Dof {YD{yecay{x",
            "description": [
                "As the source of decay shrivels, this place fills with a marvelous",
                "white light.  Diffuse in nature, the light blurs the walls until they",
                "seem to fade away.  A shimmering fog fills the area, and no one person",
                "can see more than a few steps away.  "
            ],
            "flags_raw": "0 12 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32305",
            "exits": {},
            "extras": {}
        },
        "32247": {
            "name": "{WW{west {WW{wall{x",
            "description": [
                "You are just south of the west entrance to the market place.  On the left",
                "wall hangs a tapestry depicting a large white bird, similar to a stork, but",
                "this bird is much larger and has a rigid sharp beak.  It stands on one leg",
                "like a flamingo, with a red afternoon sun hitting the water.  Birds of",
                "similar like can be seen flying in the background on the horizen, creating a",
                "black outline in front of the sun.  The title of this tapestry is, \"Issolas",
                "in Flight\".  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32247",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32260"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32241"
                }
            },
            "extras": {}
        },
        "32304": {
            "name": "{WT{whe {BR{boot {Dof {YD{yecay{x",
            "description": [
                "A dark, deathly feeling erupts from this place.  Somehow, you sense",
                "that this is the origin of whatever killed this tree and is slowly",
                "draining the life of the other nearby trees.  Any source of light",
                "brought into this room seems to flicker and fade, as if it was being",
                "drained by brute force.  "
            ],
            "flags_raw": "0 67641344 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32304",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32303"
                }
            },
            "extras": {}
        },
        "32284": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32284",
            "exits": {
                "south": {
                    "flags_raw": "32294",
                    "description": [
                        ""
                    ],
                    "room_id": "32278"
                }
            },
            "extras": {}
        },
        "32201": {
            "name": "{WT{whe {WG{wlass {WP{wlains{x",
            "description": [
                "Light!  Blinding light!  It's everywhere, sparkling off every",
                "surface for miles around.  Only in tales have you heard of this place,",
                "but you never thought it actually existed.  Supposedly, this used to",
                "be a vast desert.  When the residents of this place angered the God of",
                "Destruction, he brought forth his wrath and melted the desert with",
                "rivers of fire, boiling the sand and forever leaving it as a lifeless",
                "plain of glass.  Thus it got its name, \"The Glass Plains.\"  There",
                "appears to still be spots where the sand is melted, pools of liquid",
                "glass that looks as pure and clear as water, but hotter than the blood",
                "of a fire elemental.  Through the blindingness, it appears others have",
                "treaded this lifeless plain.  A path made of crushed and chipped glass",
                "goes onward and appears to be the most solid of the plains.  "
            ],
            "flags_raw": "0 0 0 2",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32201",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32200"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32202"
                }
            },
            "extras": {}
        },
        "32237": {
            "name": "{WM{worrolan's {WP{wrivate {WC{whambers{x",
            "description": [
                "This is the private sleeping chambers of the Lord Morrolan.  Ancient",
                "books cover the walls, written in a strange language, perhaps the written",
                "language of dragons.  The text is made of short strokes forming straight",
                "lines and simple curves, but when put together the look like a complex",
                "puzzle of lines and curves stacked together.  A simple yet elegant rose wood",
                "bed sits in the corner.  Next to it is a small table with a single lit",
                "candle.  The candle appears to be brand new, with no wax beads running down",
                "the side.  Although only a single candle, it fills the entire room with",
                "bright light.  "
            ],
            "flags_raw": "0 67108904 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32237",
            "exits": {
                "east": {
                    "flags_raw": "32239",
                    "description": [
                        ""
                    ],
                    "room_id": "32236"
                }
            },
            "extras": {}
        },
        "32293": {
            "name": "{YE{yighth {YG{yuest {YR{yoom{x",
            "description": [
                "You stand before the eighth guest room, the door looking much the same as",
                "every other door in the upper complex.  A bit of movement, however, catches",
                "your eye through the window.  Looking through, you see a few cows roaming on",
                "some grassy fields to the right of the castle.  The irrigation canals also",
                "run throughout the cow fields, creating a small spring from which the",
                "thirsty cows and grass can drink.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32293",
            "exits": {
                "south": {
                    "flags_raw": "32299",
                    "description": [
                        ""
                    ],
                    "room_id": "32298"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32292"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32294"
                }
            },
            "extras": {}
        },
        "32269": {
            "name": "{WN{worth {WE{wast {WW{wall{x",
            "description": [
                "Similar to the Iorich tapestry, this one is a picture of a swampy area",
                "covered with many lily pads.  On top of one of the lily pads is what looks",
                "like a small furry mouse.  The feet of this mouse, however, or not clawed as",
                "normal but are webbed and obviously made for swimming.  You don't recall",
                "ever seeing or hearing of an aquatic mouse.  This tapestry is title, \"Teckla",
                "on a Lily Pad.\"  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32269",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32270"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32268"
                }
            },
            "extras": {}
        },
        "32262": {
            "name": "{-F{-i{-z{-z{-g{-i{-g{-g{-'{-s {YC{Yommon {CA{cppliances{x",
            "description": [
                "A truly interesting place.  Aside from the trinkets and gadgets that are",
                "strewn all over the place, something else catches your eye.  A complex",
                "mechanism attached to the door turns and whirls, looking altogether very",
                "impressive, only to ring a bell.  With all the \"garbage\" thrown about, it's",
                "not a very good way to advertise a shop, until you notice who's behind the",
                "short counter.  A very fashion-impaired gnome.  "
            ],
            "flags_raw": "0 8 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32262",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32259"
                }
            },
            "extras": {}
        },
        "32223": {
            "name": "{YT{yangerine {GT{gree {GW{gith {WW{white {WT{wulips{x",
            "description": [
                "White tulips surround this tree, showing off their bright yellow pollen. ",
                "Small puddles of tangerine juice fill the funnel-shaped tulips.  Taking a",
                "sip from the tulip, a wave of relaxation and mixed fragrances fill your",
                "every senses.  In combination with the sweet smell of the tulip and the",
                "taste of the tangerine juice, you'd think you've found very essence of",
                "ambrosia.  No sweeter a taste have you ever experienced in your life.  It is",
                "obvious that Lord Morrolan only demands the best.  Again, the small fence",
                "corners and heads back towards the cobble stone pathway.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32223",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32222"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32224"
                }
            },
            "extras": {}
        },
        "32244": {
            "name": "{WS{wouth {WW{wall{x",
            "description": [
                "An odd picture is shown on the tapestry that hangs from this wall.  It is",
                "obvious that some of the tapestries in this hallway are not pictures of",
                "those from the Realms.  This particular one is of a giant black cat with",
                "large bat-like wings tucked in at it's sides.  The cat is perched on top of",
                "a cliff edge, a bright red moon behind it.  This tapestry is entitled,",
                "\"Tiassa.\"  To the east is another tapestry, and the staircase is to your",
                "west.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32244",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32240"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32245"
                }
            },
            "extras": {}
        },
        "32209": {
            "name": "{RA{rcross {Rt{rhe {RR{river{x",
            "description": [
                "You've made it!  Don't celebrate too soon, though, the heat is",
                "still bearing down on you like the relentless desert sun.  Coughing",
                "and wheezing, you still manage to keep your bearings right by moving",
                "away from the heat, and whatever beast may be living within those",
                "horrid fumes.  You're only choices now are to run back over obsidian",
                "bridge, through the smoke and horrid heat, or to continue on through",
                "the chasm in hopes of leaving this wretched place.  "
            ],
            "flags_raw": "0 0 0 10",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32209",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32208"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32210"
                }
            },
            "extras": {}
        },
        "32291": {
            "name": "{YS{yixth {YG{yuest {YR{yoom{x",
            "description": [
                "Looking out this window, you finally get to see what's behind the castle.",
                "A bit larger than the courtyard out in front, the ground behind the castle",
                "is occupied by a small crop.  The crop is divided into various sections. ",
                "The temperature and climate of each section is magically controlled so all",
                "sorts of vegetables, berries, and fruits can be grown all year round.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32291",
            "exits": {
                "south": {
                    "flags_raw": "32297",
                    "description": [
                        ""
                    ],
                    "room_id": "32296"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32290"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32292"
                }
            },
            "extras": {}
        },
        "32271": {
            "name": "{WN{worth {YM{yarketplace {WE{wntrance{x",
            "description": [
                "North Mainstreet is just to the south of you now.  On either side of the",
                "street is the Golden Roll bakery and Iron Forge Armory.  Even from here, you",
                "can smell the sweet aroma of freshly baked breads.  To you west and east are",
                "the hallways leading to the corner staircases and some tapestries and the",
                "market square is to your south.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32271",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32264"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32272"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32270"
                }
            },
            "extras": {}
        },
        "32296": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32296",
            "exits": {
                "north": {
                    "flags_raw": "32297",
                    "description": [
                        ""
                    ],
                    "room_id": "32291"
                }
            },
            "extras": {}
        },
        "32303": {
            "name": "{DDeep Within {cthe {yDecaying Tree{x",
            "description": [],
            "flags_raw": "0 0 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32303",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32304"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32302"
                }
            },
            "extras": {}
        },
        "32220": {
            "name": "{YO{yrange {GT{gree {GT{grimmed {GW{gith {RR{roses{x",
            "description": [
                "A massive orange tree stands before you, seemingly showing its fruit with",
                "pride.  Extremely large oranges hang from the branches, causing the branches",
                "to sag under their weight.  A ring of roses grows around the base of the",
                "tree, smelling sweet and adding to the citrus air.  The small wire fence",
                "runs along the ground a few feet to the north and stops at the edge of the",
                "path.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32220",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32225"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32221"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32219"
                }
            },
            "extras": {}
        },
        "32216": {
            "name": "{YO{yn {Yt{yhe {YE{ydge{x",
            "description": [
                "Boy, it sure is a long way down.  Looks like you're over five",
                "hundred feet in the air.  From time to time you catch a glimpse of ",
                "the ground.  Clouds circle and swirl around mountain in a dazzling",
                "display.  They look as if you had poured a dark oil into a bucket of",
                "water, the way they move and twirl about.  Still, the clouds are ",
                "white and relatively clear, allowing plenty of sunlight to reach the",
                "topside.   Beneath your feet and running all the way to the dark",
                "castle is a cobble stone walkway.  The sides are lined with a thick",
                "fluffy moss, about a foot wide, which goes for about twenty feet or so",
                "then curves around outwards forming a circle and meeting once again to",
                "continue on a straight path.  In the center of the circle is a large",
                "bronze statue, standing twelve feet in height.  It depicts a man in",
                "long robes with matching long hair.  His eyes are cold and show no",
                "feeling at all.  Both arms rest in front of him, his hand around a",
                "mighty halberd.  Etched on the blade of the halberd is the word,",
                "\"Adjudicator.\"  A belt with a death lily carved on the buckle adorns",
                "his waist.  At the base of the statue is a plaque.  "
            ],
            "flags_raw": "0 0 0 11",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32216",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32217"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32215"
                }
            },
            "extras": {}
        },
        "32279": {
            "name": "{YF{yourth {YG{yuest {YR{yoom{x",
            "description": [
                "An incredible sight can be seen through this window.  A break in the",
                "clouds has allowed you to see past the edge of the floating fortress.  Far",
                "out beyond the Glass Plains you can see a vast forest stretching farther",
                "than you can see, then falling below the horizon.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32279",
            "exits": {
                "north": {
                    "flags_raw": "32295",
                    "description": [
                        ""
                    ],
                    "room_id": "32285"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32278"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32280"
                }
            },
            "extras": {}
        },
        "32280": {
            "name": "{WS{wouth {WE{wast {WS{wtaircase{x",
            "description": [
                "A spiraling staircase leads down to the south east corner of the castle. ",
                "Oddly enough, a purple half-cape with gold trim and a leather shoulder guard",
                "hangs as decoration.  It has a picture of a Jhereg dragon, the small dragons",
                "you've seen in the Taltos painting and the tapestry.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32280",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32286"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32279"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32246"
                }
            },
            "extras": {}
        },
        "32235": {
            "name": "{WU{wp {Wt{whe {WS{wtaircase{x",
            "description": [
                "Not far up the stairs some very beautiful paintings of two women hang the",
                "walls.  Each has been painted on canvas with oil paints and extremely well",
                "done.  One could easily mistake these paintings as if someone was looking at",
                "you through a window.  Under each of the paintings is a name.  Under the one",
                "on your left is the name \"Sethra\".  She has undeathly pale skin covered by a",
                "silky white dress.  Her black hair is long and rests on the handles of her",
                "jeweled throne.  Across her lap, she holds a dagger which burns with a blue",
                "flame.  The other painting has the name \"Cawti\".  She looks to be a strong",
                "human with a shapely body in tight leather.  Her auburn hair flails about in",
                "the air as she wields a large two-handed sword and stares deep into your",
                "soul with her green eyes.  Both women are extremely beautiful.  You wonder",
                "if they were Morrolan's former consorts.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32235",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32236"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32234"
                }
            },
            "extras": {}
        },
        "32270": {
            "name": "{WN{worth {WW{wall{x",
            "description": [
                "On this wall is another tapestry of a black cat, but this one lacking the",
                "bat wings of the Tiassa.  This tapestry shows just how big the cat is, with",
                "a woman leaning against the cat's side.  The back of the great cat probably",
                "about five feet high, laying down.  You don't think you'd want to meet this",
                "thing in the wild some place.  This tapestry is titled, \"Dzur Lord.\"  If",
                "that cat is a Dzur, then it definitely earns the title of \"Lord.\"  "
            ],
            "flags_raw": "0 0 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32270",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32271"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32269"
                }
            },
            "extras": {}
        },
        "32211": {
            "name": "{RB{reneath {Rt{rhe {WS{wilver {WC{word{x",
            "description": [
                "Your keen abilities for logical deduction have indeed served you well, it ",
                "is in fact a sign.  The markings that were once only scribbles to you are",
                "now perfectly clear and legible.  The sign says:",
                "{y ",
                "{y            ______________________________,   {W\\{x",
                "{y           |'._____________________________'. {W/{x",
                "{y           | |                            @ | {W\\{x",
                "{y           | |  {G W{gelcome {Gt{go {GC{gastle {GB{glack    {y| {W/{x",
                "{y           | |   {b-----{y@{b-----------------{y    | {W\\{x",
                "{y           | |  {gIf you  have the  ability{y   | {W/{x",
                "{y           | |  {gto  fly,  please  use the{y   | {W\\{x",
                "{y           | |  {gSilver Cord  to  help you{y   | {W/{x",
                "{y           | |  {greach Castle Black safely.{y  | {W\\{x",
                "{y           | |@ {gEnjoy your visit!         {y  | {W/{x",
                "{y           | |   {b-----------------------{y    | {W\\{x",
                "{y            '|______________________________| {W/{x",
                "{y                          | |  |              {W\\{x",
                "{W           _______________{y| |  |{W______________/{x",
                "{y                          | |@ |               {W\\{x",
                "{y                          | |  |                {W\\{x",
                "{y                          | |  |                 {W\\{x",
                "{y                          | |  |                  {W\\{x",
                "{y                          \\@|  |                   {W\\ {x",
                "{y                           \\|__|                    {W\\{x",
                "{x",
                "The Silver Cord hangs precariously over the edge of the floating castle,",
                "many hundreds of miles up."
            ],
            "flags_raw": "0 0 0 2",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32211",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32210"
                },
                "up": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32212"
                }
            },
            "extras": {}
        },
        "32285": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32285",
            "exits": {
                "south": {
                    "flags_raw": "32295",
                    "description": [
                        ""
                    ],
                    "room_id": "32279"
                }
            },
            "extras": {}
        },
        "32221": {
            "name": "{YLemon {GT{gree {GW{gith {BB{blue {BO{brchids{x",
            "description": [
                "This tree is adorned with sour-sweet lemons.  The combination of flavours",
                "is absolutely amazing.  You've never tasted a \"sweet\" lemon like this",
                "before.  You wonder how the trees were changed to do this.  Perhaps it was",
                "mixed with an orange tree; but then again it doesn't have the orange flavour",
                "with it.  Somehow, though, these lemons have a sweet kick to them that makes",
                "them quite tasty.  A ring of dark blue orchids surrounds this lemon tree.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32221",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32224"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32222"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32220"
                }
            },
            "extras": {}
        },
        "32260": {
            "name": "{WW{west {YM{yarketplace {WE{wntrance{x",
            "description": [
                "The marketplace opens up into a large courtyard, housing several shops. ",
                "The shops look to be two stories, but the second floor of each shop is",
                "actually a guest room for Lord Morrolan's honored guests.  With only eight",
                "rooms, Lord Morrolan must not get very many guests.  To the north and south",
                "are two more tapestries.  "
            ],
            "flags_raw": "0 0 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32260",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32247"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32261"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32259"
                }
            },
            "extras": {}
        },
        "32224": {
            "name": "{YLemon {GT{gree {GW{gith {WD{wa{Wi{ws{Wi{we{Ws{x",
            "description": [
                "A small bushel of white and yellow daisies occupy the base of the lemon",
                "tree, moving ever so slightly from a light breeze that seems to be ever",
                "constant in this small orchard.  Although small, it is quite possible that",
                "with the number and size of fruit these trees produce to supply an entire",
                "village with ample fruit.  It is most likely magic that keeps this orchard",
                "so alive and fruitful.  No person could cultivate an orchard such as this",
                "naturally.  None that you've ever heard of at least.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32224",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32221"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32223"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32225"
                }
            },
            "extras": {}
        },
        "32300": {
            "name": "{CT{che {WS{wtone {CC{circle{x",
            "description": [
                "This is an interesting sight, to say the least.  A circle of stones",
                "structures have been erected.  Each structure has two vertical pieces,",
                "standing over ten feet tall, and a horizontal piece across the top,",
                "averaging the same height as the others.  In the center of structures",
                "is a giant circular slab with various runes carved upon them.  The",
                "runes themselves seem to be glowing with an eerie blue hue.  After",
                "observing for a few minutes, you see a bird fly into the circle",
                "holding some twigs and twine, where it suddenly vanishes into thin",
                "air.  "
            ],
            "flags_raw": "0 67108868 0 2",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32300",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "33582"
                }
            },
            "extras": {}
        },
        "32219": {
            "name": "{GE{gxiting {Gt{ghe {GO{grchard{x",
            "description": [
                "A definite sight.  Never have you seen fruit that large, save for those",
                "grown in the Titan valleys.  The oranges are twice the size of a human fist,",
                "the tangerines closely following, and lemons that make mellons jealous.  The",
                "peels on the fruit offer no resistance and seem to simply fall off, inviting",
                "you to indulge in its sweet flavour.  The lemons, if they could be called",
                "that, taste as though the gods added a spoon of sugar into each lemon,",
                "offering a sweet as well as sour feast for your taste buds.  This is a",
                "remarkable orchard.  "
            ],
            "flags_raw": "0 0 0 11",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32219",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32218"
                },
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32232"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32220"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32226"
                }
            },
            "extras": {}
        },
        "32288": {
            "name": "{WN{worth {WE{wast {YHa{yllway{x",
            "description": [
                "A relatively short robed man stands in this picture.  He stands in a",
                "circular room which is relatively plain except for a glowing blue circle in",
                "the center.  The man is raising his hands upward with a face of extreme",
                "concentration.  From his forehead to the circle in the room are what look to",
                "be ripples in the air.  A faint outline of a person standing in the circle",
                "shimmers in the low light of the hallway.  Etched at the bottom of the",
                "painting is the what you assume to be the name of this magic user, \"Mario.\" "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32288",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32294"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32286"
                }
            },
            "extras": {}
        },
        "32227": {
            "name": "{YO{yrange {GT{gree {GW{gith {MColumbines{x",
            "description": [
                "How many orange pickers does it take to pick an orange?  Well, from the",
                "looks of these, at least four.  It would take an army to pick and carry all",
                "of these oranges.  At the base of the tree are a group of vibrant pink",
                "flowers.  Columbines it looks like.  A lemon tree is just to the east with a",
                "tangerine tree shortly following.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32227",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32226"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32218"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32229"
                }
            },
            "extras": {}
        },
        "32301": {
            "name": "{YA {YP{yath {GI{gn {Gt{ghe {GF{gorest{x",
            "description": [
                "It doesn't seem like the portal took you very far except to a small",
                "circular clearing, until you notice that the forest you're in is made",
                "up of entirely different trees.  To the north of the clearing is a",
                "path that doesn't look to have been traveled very often.  Off in the",
                "distance, a white glow seems to be emanating from the north.  "
            ],
            "flags_raw": "0 1 0 3",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32301",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32200"
                }
            },
            "extras": {}
        },
        "32286": {
            "name": "{WS{wouth {WE{wast {YH{yallway{x",
            "description": [
                "Along side this hallway, as well as the rest of the hallway, are a couple",
                "more paintings.  On the wall next to you is an oil painting of a very tall",
                "man with similar features to Lady Teldra.  He's leaning back in a wooden",
                "chair against a wall in some sort of office.  A knife board is above his as",
                "he twirls the point of a knife in his palm.  The bottom of the painting is",
                "title, \"Kragar.\"  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32286",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32288"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32280"
                }
            },
            "extras": {}
        },
        "32298": {
            "name": "{YG{yuest {YR{yoom{x",
            "description": [
                "This is the standard guest quarters for all of Morrolan's guests.  A",
                "single yet very comfortable feather bed lay against the far wall with a",
                "dresser against the right wall.  The dresser has many drawers for which",
                "guests can store their items temporarily, as well as a mirror to tidy up",
                "before dining and other events.  "
            ],
            "flags_raw": "0 67108872 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32298",
            "exits": {
                "north": {
                    "flags_raw": "32299",
                    "description": [
                        ""
                    ],
                    "room_id": "32293"
                }
            },
            "extras": {}
        },
        "32254": {
            "name": "{WE{wast {WW{wall{x",
            "description": [
                "On the east wall is what looks like a picture of an owl, except it has",
                "silvery metallic feathers.  In this picture, the owl-like animal is flying",
                "above a sea of clouds, illuminated by the moon.  An incredible picture. ",
                "This tapestry is labeled, \"Athyra in Moonlight\".  The eastern market",
                "entrance is just north of you, and the staircase is to the south.  "
            ],
            "flags_raw": "0 8 0 1",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32254",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32253"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32246"
                }
            },
            "extras": {}
        },
        "32281": {
            "name": "{WS{wouth {WW{west {YH{yallway{x",
            "description": [
                "In place of windows in this hallway some oil painting similar to those",
                "along the staircase decorate the wall.  This particular painting is a",
                "picture of a man wielding two metal-plated clubs and leaning against the",
                "wall of a tavern.  He's giving a sinister, but playful grin, as he points",
                "one of his clubs at you.  The word \"Sticks\" is imprinted at the bottom of",
                "the painting.  "
            ],
            "flags_raw": "0 8 0 0",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32281",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32287"
                },
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32275"
                }
            },
            "extras": {}
        },
        "32203": {
            "name": "{WB{wefore {Wt{whe {CS{ctaircase{x",
            "description": [
                "Without the shade, you would have blindly stepped over the edge.  A",
                "giant stair- case leads down into a black chasm.  On the sides of the",
                "chasm you can see various layers of color, starting with the clear",
                "crystaline glass at the top then turning into a black obsidian.  The",
                "staircase also follows this gradient, but this does not seem to be",
                "your ordinary staircase; each step an easy three feet in height.  Who",
                "or what uses this staircase is probably best left alone.  Your",
                "pondering is broken when you notice the shadow is not created by a",
                "cloud, but something far more marvelous.  What appears to be a giant,",
                "inverted, floating mountain with the point facing the ground floats",
                "above the end of the chasm.  A tiny structure can be seen atop the",
                "flat surface, where a glint of light flashes off it.  Alas, a name",
                "comes to mind, \"Castle Black.\"  It is said by ancient bards that an",
                "immortal lord by the name of Lord Morrolan lives there, protecting any",
                "and all who enter his castle and politely ask for his protection.  No",
                "fighting goes on within those walls, and those who break Lord",
                "Morrolan's trust will know pain nearly rivaling that of Cyric.  He is",
                "also the holder of one of three still existing Great Weapons.  With",
                "the aid of a flight, one could possibly reach the castle.  "
            ],
            "flags_raw": "0 0 0 2",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32203",
            "exits": {
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32202"
                },
                "down": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32204"
                }
            },
            "extras": {}
        },
        "32222": {
            "name": "{YT{yangerine {GT{gree {GW{gith {ML{mavenders{x",
            "description": [
                "Large, plump, tangerines burdon this tree, just right for the picking. ",
                "These tangerines are about the size of your standard orange.  Simply holding",
                "one, it feels as though the tangerine is going to burst with juice.  Small",
                "droplets of juice squeeze out of the porous skin of the tangerine.  At the",
                "base of the tree is a circle of lavenders, catching the droplets of juice in",
                "their sweet-smeilling peddles.  Here, the small fence stops and bends its",
                "way southward.  "
            ],
            "flags_raw": "0 0 0 19",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32222",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32223"
                },
                "east": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32221"
                }
            },
            "extras": {}
        },
        "32251": {
            "name": "{GA{gleira's {WS{wcrolls{x",
            "description": [
                "All sorts of scrolls can be seen here, some of them very powerful. ",
                "Hundreds of scroll tubes cover the walls, all filled with scrolls no doubt. ",
                "Behind the shop counter is a small room with a desk covered in papers and",
                "various colours of ink bottles, each one accompanied by a brilliant quill. ",
                "Aliera must make her scrolls right here in the shop, and with this many",
                "scrolls, you wonder if she has any free time on her hands at all.  "
            ],
            "flags_raw": "0 8 0 13",
            "wanted_area_vnum": "",
            "flags2_raw": "0",
            "vnum": "32251",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32256"
                },
                "west": {
                    "flags_raw": "0",
                    "description": [
                        ""
                    ],
                    "room_id": "32250"
                }
            },
            "extras": {}
        }
    },
    "uid": "castlebl",
    "area_quest_points": 0,
    "credits": "[99 FR HR] Castle Black",
    "faction_id": "",
    "vnums": [
        32200,
        32349
    ],
    "recall_room_id": 51050,
    "objects": {},
    "security": 10,
    "mobiles": {
        "32266": {
            "name": "Grizwald~\n",
            "description": [
                "An extremely tall man, nearly seven feet high.  This man is bulging\n",
                "with muscles, no doubt from the years of hammering magical weaponry. \n",
                "Griswald wears his hair long, which is jet black.  Around his body is\n",
                "a thick leather worksman vest with various tools strapped to it. \n",
                "Despite the environment he works in, this man is quite handsome and\n",
                "wields his forging hammer with ease.  \n"
            ],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "0 0 medium unknown",
            "raw_flags4": "0 ABCDQ 0 0",
            "raw_flags3": "-10 -10 -10 -10",
            "vnum": 32266,
            "raw_flags": "ABTZ 0 0 0 0",
            "race_id": "human",
            "raw_form": "AHMV",
            "raw_flags2": "101 50 1000d1+0 0d0+0 10d10+10 punch",
            "d_flags": "D ~",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n",
                "M SPEECH 32228 wyrm~\n",
                "M GREET 32225 100~\n",
                "M SPEECH 32233 oil~\n",
                "M SPEECH 32229 hide~\n"
            ],
            "t_flags": "T ~",
            "room_name": "Grizwald, the master weapon smith, stands here.\n",
            "raw_parts": "ABCDEFGHIJK",
            "keywords": "grizwald~\n"
        },
        "32203": {
            "name": "A {WC{8astle {GW{gatchguard{x~\n",
            "description": [
                "He is tall, heavily armored and very serious about his position. \n",
                "He doesn't even flinch at your arrival, but holds his vigil with pride\n",
                "over the battlements of Castle Black.  \n"
            ],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "0 0 medium unknown",
            "raw_flags4": "0 0 0 0",
            "raw_flags3": "0 0 0 0",
            "vnum": 32203,
            "raw_flags": "AB 0 0 0 0",
            "race_id": "human",
            "raw_form": "AHMV",
            "raw_flags2": "0 0 5d5+100 5d5+100 5d5+10 none",
            "d_flags": "D ~",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n"
            ],
            "t_flags": "T ~",
            "room_name": "A {WC{8astle {GW{gatchguard{x stands watch here.\n",
            "raw_parts": "ABCDEFGHIJK",
            "keywords": "cbwg~\n"
        },
        "32265": {
            "name": "Roen~\n",
            "description": [
                "A young lad in his late teens, his face and hands are black with\n",
                "soot.  You think he has brown hair, but it's hard to tell with it\n",
                "being so dirty.  He wears a shirt that used to be white under a very\n",
                "thick leather apron.  On the many loop holes on his apron, a hammer,\n",
                "carving pick, and chisel hang, the tools he uses most often.  Although\n",
                "only Grizwald's assistant, Roen is an established armorer and very\n",
                "good at what he does.  \n"
            ],
            "raw_flags5": "stand stand male 1000000",
            "raw_flags6": "0 0 medium unknown",
            "raw_flags4": "0 ABCDQ 0 0",
            "raw_flags3": "0 0 0 0",
            "vnum": 32265,
            "raw_flags": "ABTZ DF 0 0 0",
            "race_id": "human",
            "raw_form": "AHMV",
            "raw_flags2": "0 50 1000d1+0 0d0+0 10d10+10 punch",
            "d_flags": "D ~",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n",
                "M SPEECH 32227 wyrm~\n",
                "M GREET 32226 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "Roen, assistant to Grizwald, manages the store.\n",
            "raw_parts": "ABCDEFGHIJK",
            "keywords": "roen~\n"
        },
        "32262": {
            "name": "{-F{-i{-z{-z{-g{-i{-g{-g{x~\n",
            "description": [
                "Just looking at this gnome brings a chuckle.  This is the most\n",
                "fashion-impaired gnome you have ever seen.  He wears bright red robes\n",
                "with yellow stars all about and a tall pointy cap to match.  At the\n",
                "top of his wizard hat is a gold star dangling from a wire that bobs\n",
                "around when he walks.  In addition, little bells have been sewn to the\n",
                "tips of his curly slippers, jingling with each step he takes.  A truly\n",
                "comical sight!  \n"
            ],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "AHMV ABCDEFGHIJK small unknown",
            "raw_flags4": "0 ABCDQ JLP R",
            "raw_flags3": "-10 -10 -10 -10",
            "vnum": 32262,
            "raw_flags": "ABR DFJc 0 0 0",
            "race_id": "gnome",
            "raw_flags2": "101 50 1000d1+0 1000d1+0 10d10+10 punch",
            "d_flags": "D ~",
            "subroutines": [
                "M GREET 32219 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "A wildy dressed gnome stands behind the counter, tinkering with something.\n",
            "keywords": "fizzgigg gnome~\n"
        },
        "32263": {
            "name": "Cyril~\n",
            "description": [
                "Cyril is the master baker of Castle Black.  He supplies all the\n",
                "baked goods for the castle as well as for his Lord's guests.  His face\n",
                "and hands are white with baking flower as he huffs and puffs to make\n",
                "all the bread.  Cyril is a large man, wearing a cooking apron with a\n",
                "matching white outfit and puffy sheff hat.  \n"
            ],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "0 0 medium unknown",
            "raw_flags4": "0 ABCDQ 0 0",
            "raw_flags3": "-10 -10 -10 -10",
            "vnum": 32263,
            "raw_flags": "ABL DF 0 0 0",
            "race_id": "human",
            "raw_form": "AHMV",
            "raw_flags2": "0 50 1000d1+0 0d0+0 10d10+10 punch",
            "d_flags": "D ~",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n",
                "M GREET 32218 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "Cyril, the master baker of Castle Black, is standing here.\n",
            "raw_parts": "ABCDEFGHIJK",
            "keywords": "cyril~\n"
        },
        "32200": {
            "name": "Godsmith's Walking Spellbook~\n",
            "description": [
                "Old, but still in good condition, it's a walking spellbook!  Along the binding in\n",
                "gold-leaf lettering is the name \"Godsmith.\"  Some form of arcane text glows with\n",
                "a brilliant color on the cover of the book.\n"
            ],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "AGV CH small unknown",
            "raw_flags4": "H ABCILQSX 0 H",
            "raw_flags3": "0 0 0 0",
            "vnum": 32200,
            "raw_flags": "AIZa DFJVc 0 0 0",
            "race_id": "dog",
            "raw_flags2": "101 200 5000d1+0 9000d1+999 300d3+0 magic",
            "d_flags": "D ~",
            "subroutines": [
                "F par ADEFJKUV\n"
            ],
            "t_flags": "T ~",
            "room_name": "A walking spellbook is here, casting spells.\n",
            "raw_parts": "ADEFJKUV",
            "keywords": "book spellbook walking~\n"
        },
        "32233": {
            "name": "{WAn innocent {Mpixie{x~\n",
            "description": [],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "AHMV ABCDEFGHIJKP medium unknown",
            "raw_flags4": "0 ABGLQRTX BJP RZ",
            "raw_flags3": "0 0 0 0",
            "vnum": 32233,
            "raw_flags": "AZ EJTUV 0 0 0",
            "race_id": "pixie",
            "raw_flags2": "101 0 5d5+10 10d10+10 1d1+0 scratch",
            "d_flags": "D ~",
            "subroutines": [],
            "t_flags": "T ~",
            "room_name": "{WA tiny, innocent {Mpixie girl {Wis {Bpetrified{W inside a {Csolid crystal shard.{x\n",
            "keywords": "innocent tiny pixie girl pixiegirlmobforroot~\n"
        },
        "32202": {
            "name": "Test mob~\n",
            "description": [],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "0 0 medium unknown",
            "raw_flags4": "0 ABCD 0 0",
            "raw_flags3": "0 0 0 0",
            "vnum": 32202,
            "raw_flags": "A 0 0 0 0",
            "race_id": "human",
            "raw_form": "AHMV",
            "raw_flags2": "120 0 400d400+1500 0d0+0 0d0+0 none",
            "d_flags": "D ~",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n",
                "M FIGHT 32304 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "A Test mobile sits here. Watch out!\n",
            "raw_parts": "ABCDEFGHIJK",
            "keywords": "Test Mob~\n"
        },
        "32235": {
            "name": "{RUNUSED{x~\n",
            "description": [],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "AHMV ABCDEFGHIJK medium unknown",
            "raw_flags4": "0 0 0 0",
            "raw_flags3": "0 0 0 0",
            "vnum": 32235,
            "raw_flags": "A 0 0 0 0",
            "race_id": "human",
            "raw_flags2": "101 200 1d1+0 0d0+0 1d1+0 punch",
            "d_flags": "D ~",
            "subroutines": [],
            "t_flags": "T ~",
            "room_name": "{x\n",
            "keywords": "unused~\n"
        },
        "32238": {
            "name": "{WL{word {WM{worrolan{x~\n",
            "description": [
                "The famed Lord Morrolan, the creater and master of Castle Black. The \n",
                "mere presence of this man causes the air around you to tremble. He \n",
                "wears his dark hair long and very nicely groomed.  Around his body\n",
                "are black robes of soft velvetty cloth.  His eyes are a purple hue\n",
                "which crackle like lightning and change to a deep red from time to\n",
                "time.  At his side is a large halberd with the same words inscribed\n",
                "on it as on the statue plaque, \"Adjudicator\".  A light hum comes\n",
                "from the halberd. \n"
            ],
            "raw_flags5": "stand stand male 1000000",
            "raw_flags6": "AMV ABCDEFGHIJKQU medium unknown",
            "raw_flags4": "FHIKNR ABHLQ MNOP CK",
            "raw_flags3": "-180 -180 -180 -180",
            "vnum": 32238,
            "raw_flags": "ABMRU DFVc CDEHR 0 0",
            "race_id": "school monster",
            "raw_flags2": "107 500 25000d40+25000 30000d1+30000 80d80+400 punch",
            "d_flags": "D ~",
            "subroutines": [
                "M FIGHT 32300 100~\n",
                "M SPEECH 32208 yes~\n",
                "M GREET 32207 100~\n",
                "M SPEECH 32217 eight~\n",
                "M SPEECH 32216 seven~\n",
                "M SPEECH 32215 six~\n",
                "M SPEECH 32214 five~\n",
                "M SPEECH 32213 four~\n",
                "M SPEECH 32212 three~\n",
                "M SPEECH 32211 two~\n",
                "M SPEECH 32209 one~\n",
                "M FIGHT 32240 40~\n",
                "M FIGHT 32239 30~\n",
                "M SPEECH 32210 no~\n",
                "M KILL 32237 100~\n",
                "M DEATH 32243 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "The master of Castle Black is here, donned in fine black robes.\n",
            "keywords": "master lord morrolan~\n"
        },
        "32208": {
            "name": "{RT{Yh{re {RF{Yir{Re {rW{Yy{Rr{rm{x~\n",
            "description": [
                "Said to be a construct of Talos' fury, this fierce dragon is now the\n",
                "guardian of Castle Black; forged from the very essence of rage and fire.  \n"
            ],
            "raw_flags5": "stand stand none 100000",
            "raw_flags6": "AHMVZ ABCDEFGHIJKLPQUVWX large unknown",
            "raw_flags4": "ABCFHKMR ABFGHLPQS CEHJ IK",
            "raw_flags3": "-55 -55 -55 -55",
            "vnum": 32208,
            "raw_flags": "ABFOTU DFJQTVZc ADHR 0 0",
            "race_id": "school monster",
            "raw_flags2": "101 600 20000d1+20000 20000d1+0 600d20+0 shbite",
            "d_flags": "D {xgives off a {gshrieking{x wale and {Ye{yx{Yp{yl{Yo{yd{Ye{ys{x in a {Ws{wh{Wo{ww{We{wr{x of {Rb{rurning{x scales!~",
            "subroutines": [
                "F vul C\n",
                "M EXALL 32242 3~\n",
                "M GRALL 32239 100~\n",
                "M FIGHT 32201 50~\n",
                "M FIGHT 32200 50~\n",
                "M FIGHT 32202 30~\n",
                "M FIGHT 32203 20~\n",
                "M FIGHT 32239 35~\n",
                "M RANDOM 32299 10~\n",
                "M DEATH 32238 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "The bane of all who seek to destroy Castle Black is here defending his home, {RT{Yh{re {RF{Yir{Re {rW{Yy{Rr{rm{x.\n",
            "raw_vulns": "C",
            "keywords": "firewyrm dragon~\n"
        },
        "32248": {
            "name": "Aliera~\n",
            "description": [
                "Gracefully, she walks throughout the room.  Her steps are so light\n",
                "and even she looks as though she were levitating, head not rising more\n",
                "than a centimeter each step.  She wears dark red robes made of silk\n",
                "with a golden rope-belt around her waist.  Her hair is black with dark\n",
                "green here and there.  She speaks with a thick accent you not familiar\n",
                "with.  \n"
            ],
            "raw_flags5": "stand stand female 0",
            "raw_flags6": "A ABCDEFGHIJK medium unknown",
            "raw_flags4": "CFIK BCDLQ 0 0",
            "raw_flags3": "0 0 0 0",
            "vnum": 32248,
            "raw_flags": "ABR DF 0 0 0",
            "race_id": "human",
            "raw_form": "HMV",
            "raw_flags2": "105 0 20000d2+10000 0d0+0 40d20+10 punch",
            "d_flags": "D ~",
            "subroutines": [
                "F for HMV\n",
                "M GREET 32220 100~\n",
                "M SPEECH 32231 more~\n",
                "M SPEECH 32230 hide~\n",
                "M SPEECH 32244 everburning~\n",
                "M SPEECH 32245 rekindle the flame~\n",
                "M SPEECH 32246 i am ready~\n"
            ],
            "t_flags": "T ~",
            "room_name": "Aliera is here, tending to her magical items.\n",
            "keywords": "Aliera~\n"
        },
        "32201": {
            "name": "the Decaying Root~\n",
            "description": [
                "This 3-meter piece of root oozes and flows with dark energy.  A\n",
                "dark grey in color, its sharp tip waves around wildly, warding off any\n",
                "who would seek to examine it more closely.  \n"
            ],
            "raw_flags5": "stand stand none 100000",
            "raw_flags6": "AGXYc ADEFKLQVX large fiber",
            "raw_flags4": "FGHIK ABHLQ DO KN",
            "raw_flags3": "-50 -50 -50 -50",
            "vnum": 32201,
            "raw_flags": "ABMNU DFJZ CDEP -150 0",
            "race_id": "snake",
            "raw_resistances": "L",
            "raw_flags2": "115 150 500d500+31000 50d50+2000 150d50+9000 shock",
            "d_flags": "D ~",
            "subroutines": [
                "F res L\n",
                "F vul I\n",
                "M DEATH 32301 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "This long piece of decayed root seems more animated than the rest.\n",
            "raw_vulns": "I",
            "keywords": "root decay undead~\n"
        },
        "32216": {
            "name": "{xA {Yb{yronze{x statue~\n",
            "description": [
                "{Y      ____________________\n",
                "{Y     |{y'.{Y__________________{y'.{x\n",
                "{Y     |{y::{Y\\                   {Y\\\n",
                "{Y     |{y:::{Y\\  {GW{gelcome {Ga{gll {Gt{go   {Y\\\n",
                "{Y     |{y::::{Y\\  {BC{bastle   {BB{black{G.  {Y\\\n",
                "{Y     |{y:::::{Y\\  {GA{gll  {Ga{gre  {Gs{gafe   {Y\\\n",
                "{Y     |{y......{Y\\  {Gw{githin {Gm{gy {Gw{galls{G. {Y\\\n",
                "{Y     |{y.......{Y\\  {GA{gll {Gy{gou {Gn{geed {Gd{go  {Y\\\n",
                "{Y     |{y........{Y\\  {Gi{gs  {Ga{gsk{G.  T{ghose  {Y\\\n",
                "{Y     |{y . . . . {Y\\  {Gw{gho  {Gb{greak  {Gm{gy   {Y\\\n",
                "{Y     |{y. . . . . {Y\\  {Gt{grust {Gw{gill {Gd{gie{G.  {Y\\\n",
                "{Y     |{y .  .  .  .{Y\\___________________\\\n",
                "{Y     |___________|___________________|{x\n"
            ],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "0 0 medium unknown",
            "raw_flags4": "0 AB 0 0",
            "raw_flags3": "0 0 0 0",
            "vnum": 32216,
            "raw_flags": "ABZ 0 0 0 0",
            "race_id": "human",
            "raw_form": "AHMV",
            "raw_flags2": "1 0 100d1+0 0d0+0 0d0+0 none",
            "d_flags": "D {xshatters apart into small fragments.  Better not let Lord Morrolan know you destroyed his statue...~",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n"
            ],
            "t_flags": "T ~",
            "room_name": "{xA {Yb{yronze{x {ws{Wt{wa{Wt{wu{We{x stands here, {Bc{bold{x and {Me{mmotionless{x.\n",
            "raw_parts": "ABCDEFGHIJK",
            "keywords": "statue plaque bronze~\n"
        },
        "32249": {
            "name": "Aliera's Assistant~\n",
            "description": [
                "Aliera's assistant has long brown hare with hazle eyes.  She wears\n",
                "dark green robes and ties her hair back into a pony tail, thrown over\n",
                "right shoulder.  She is a very beautiful woman; with light red lips\n",
                "and rosy cheaks, her face would not need any cosmetic attention.  \n"
            ],
            "raw_flags5": "stand stand none 10000000",
            "raw_flags6": "A ABCDEFGHIJK medium unknown",
            "raw_flags4": "0 Q 0 0",
            "raw_flags3": "-10 -10 -10 -10",
            "vnum": 32249,
            "raw_flags": "ABR 0 0 0 0",
            "race_id": "human",
            "raw_form": "HMV",
            "raw_flags2": "0 0 2000d1+1000 1000d1+0 10d10+10 slap",
            "d_flags": "D ~",
            "subroutines": [
                "F for HMV\n",
                "M GREET 32221 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "Aliera's assistant stands here, waiting to help you with your purchases.\n",
            "keywords": "assistant~\n"
        },
        "32251": {
            "name": "The Scribe~\n",
            "description": [
                "A young man, probably around the age of 25 or so, he is the scribe\n",
                "assistant of Aliera.  His task is to make sure the scrolls are not\n",
                "damaged and manage the store for her.  He has short blonde hair, near\n",
                "to white, and wears white robes.  His eyes are an odd blue green\n",
                "color, but compliment his outfit very well.  \n"
            ],
            "raw_flags5": "stand stand none 500000",
            "raw_flags6": "0 0 medium unknown",
            "raw_flags4": "0 ABCDEQ 0 0",
            "raw_flags3": "0 0 0 0",
            "vnum": 32251,
            "raw_flags": "ABR DF 0 0 0",
            "race_id": "human",
            "raw_form": "AHMV",
            "raw_flags2": "0 50 500d1+500 1000d1+0 10d10+10 punch",
            "d_flags": "D ~",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n",
                "M GREET 32222 100~\n",
                "M SPEECH 32223 scroll~\n"
            ],
            "t_flags": "T ~",
            "room_name": "Aliera's Scribe is here, taking care of the scrolls.\n",
            "raw_parts": "ABCDEFGHIJK",
            "keywords": "scribe assistant~\n"
        },
        "32252": {
            "name": "{BG{ceffe{Bn {8the {GJ{geweler{x~\n",
            "description": [
                "The like the gems he works with, his eyes flash with an inner\n",
                "light.  This man is a talented soul, crafting some very fine jewelry. \n",
                "When asked where he gets his strange metals and gems, he smiles and\n",
                "winks saying, \"Now if I told ya', I'm betting you'd run off and I'd\n",
                "soon be out of a job!\"  \n"
            ],
            "raw_flags5": "stand stand none 0",
            "raw_flags6": "A ABCDEFGHIJK medium unknown",
            "raw_flags4": "0 ABCDQ 0 0",
            "raw_flags3": "-10 -10 -10 -10",
            "vnum": 32252,
            "raw_flags": "ABS DF 0 0 0",
            "race_id": "human",
            "raw_form": "HMV",
            "raw_flags2": "106 50 10d10+10 0d0+0 10d10+10 punch",
            "d_flags": "D ~",
            "subroutines": [
                "F for HMV\n",
                "M SPEECH 32248 rien~\n",
                "M SPEECH 32247 gem of power~\n",
                "M GREET 32224 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "{BG{ceffe{Bn {8the {GJ{geweler{x is here, crafting more fine jewelry.\n",
            "keywords": "Geffen jeweler~\n"
        },
        "32234": {
            "name": "{xLady Teldra~\n",
            "description": [
                "Lady Teldra, mistress of Lord Morrolan.  She is the head caretaker of\n",
                "Castle Black and lover to Lord Morrolan.  She is very tall, over six feet,\n",
                "and very slender.  Although she looks fragile, her body is very well toned\n",
                "and has a nice muscular curvature to it.  Her ears are pointed, but with her\n",
                "height and narrow face she would make an odd elf.  Then remembering some old\n",
                "bard's tales, you realize that she is not an elf at all.  She is the last of\n",
                "her race, known as Dragarians.  Dragarians are dragons who gave up their\n",
                "life as a dragon by using their natural ability to polymorph and changing\n",
                "themselves permanently into this humanoid form.  \n"
            ],
            "raw_flags5": "stand stand female 0",
            "raw_flags6": "AHM ABCDEFGHIJK medium unknown",
            "raw_flags4": "0 AB BC 0",
            "raw_flags3": "-30 -30 -30 -30",
            "vnum": 32234,
            "raw_flags": "ABL DF HNO 0 0",
            "race_id": "human",
            "raw_form": "V",
            "raw_flags2": "101 200 20000d1+0 0d0+0 50d20+0 punch",
            "d_flags": "D {xweeps as she falls to the ground, \"We only wanted to help...\"~",
            "subroutines": [
                "F for V\n",
                "M SPEECH 32206 market~\n",
                "M SPEECH 32205 morrolan~\n",
                "M GREET 32204 100~\n"
            ],
            "t_flags": "T ~",
            "room_name": "Lady Teldra is here, looking at you with kind eyes.\n",
            "keywords": "lady teldra~\n"
        }
    },
    "realm_id": 1
}