{
    "security": 6,
    "recall_room_id": 3001,
    "id": "drkstn",
    "zone_id": 0,
    "objects": {},
    "uid": "drkstn",
    "rooms": {
        "12272": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Huffing and puffing, you finally make it to the door of the last",
                "floor.  Carefully, you open the door, panting heavily as you silently",
                "close it behind you.  It takes a moment for your eyes to adjust to the",
                "darkness; apparently there are no windows whatsoever nor any other",
                "form of light.  As you quickly rummage through your pack to find a",
                "torch, two bright red lights suddenly appear before you.  \"So...\"  He",
                "whispers, \"You thought you could reach my master unhindered?  Prepare",
                "yourself.  It will be a pleasure to drag your lifeless body to his",
                "feet, once I've taken your soul!\"  Suddenly, the two bright orbs of",
                "light rush toward you at unimaginable speed.  "
            ],
            "name": "A Pitch Black Room",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12271",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12273",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12272"
        },
        "12250": {
            "extras": {
                "sign": {
                    "description": [
                        "Woe onto those that have come to this cursed place. Your life shall",
                        "come to an end if you set another foot on this cursed tower's grounds. Alzaphain, lord of the tower, shall make your",
                        "death long and painful, should you even attempt entry. Once again, I beseech you, LEAVE THIS CURSED PLACE BE!",
                        ""
                    ]
                }
            },
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "{B----------------------------------------------------------",
                "{8In th{Be d{bist{8ance you see {ba C{Bast{8l{Be. {bThe{8 castle is shroud{bed {Bin",
                "{8darkne{Bss {band{8 the clouds s{beem{B t{Bo h{bang{8 a little lower th{ben {Bnormal.",
                "{8What{B yo{bu t{8hought was gra{bss {Bbef{8o{Bre {byou{8 realize is wayw{bard{b soul",
                "{8matt{Ber.{b  T{8he fields of {bthi{Bs m{8att{Ber {baro{8und, you seem to{b gl{Bow a",
                "{8lumin{Besc{bent{8 blue.  There{b is{B mu{8c{Bh b{beau{8ty in this forsake{bn l{Band.",
                " ",
                "{B----------------------------------------------------------{x"
            ],
            "name": "{8Fi{Bel{bds{8 of Zinde{bl-T{Bho{8rn{x",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12251",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12250"
        },
        "12253": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [],
            "name": "A Dark Hallway",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12254",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12252",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12253"
        },
        "12263": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Having defeated that trio of magi, you're confidence is at quite a",
                "high...  Only to be brought strait back down again at the sight of",
                "your next foe.  The second of Alzaphains generals, Shizon, looks like",
                "someone who could eat you for breakfast.  He actually smiles as you",
                "walk in, not one of friendship, but one of impending doom.  He",
                "casually walks over to you from his desk cluttered with books and",
                "scrolls and walks within 10 feet of you, and then crosses his arms",
                "across his chest.  He looks you up and down as you stare in awe.  He",
                "isn't very tall, only about 5 foot 6, and wears a black robe with a",
                "tied rope around the waist.  The hood of his robe is set back,",
                "revealing his slit-back brown hair and a large scar than runs from the",
                "upper left of his forehead to his lower right cheek.  Having finished",
                "summing you up, he begins an incantation.  Before you can react, both",
                "his hands are clasped in front of his body, and they slowly expand",
                "outward.  A blinding blue light emanates from the increasing gap",
                "between his two hands.  As soon as his hands are about six feet apart,",
                "he finishes his incantation and a large, black, serpent headed staff",
                "lies in his hands.  \"Shall we get on with it?\"  He muses, and you",
                "quickly respond by charging for him.  "
            ],
            "name": "Shizon's Quarters",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "room_id": "12264",
                    "description": [
                        ""
                    ]
                },
                "south": {
                    "flags_raw": "0",
                    "room_id": "12262",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12263"
        },
        "12271": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "\"Christ\" you murmur as you approach the final immensely long",
                "staircase, \"I hope Alzaphain isn't that hard.\"  Healing your wounds as",
                "you climb the stairs, you begin to wonder if perhaps there is an",
                "eaiser way to quick fortune and upholding the honor of your kingdom",
                "than this.  Shrugging, you force yourself to climb the last few stairs",
                "and enter the final floor.  "
            ],
            "name": "A Spiral Stairway",
            "exits": {
                "down": {
                    "flags_raw": "0",
                    "room_id": "12270",
                    "description": [
                        ""
                    ]
                },
                "south": {
                    "flags_raw": "0",
                    "room_id": "12272",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12271"
        },
        "12277": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "You throw open the door to Alzaphains throneroom, anger and",
                "determination both on your face.  \"Alzaphain!\"  You should, \"Your rule",
                "is at an end!\"  A tall man, wearing a white tunic and brown trousers,",
                "with black hair pulled back into a ponytail and black eyes looks down",
                "at you from his high throne.  \"Well, if it isn't the warriors I've",
                "been hearing so much of.  You think you can beat me?  I will crush",
                "you, then I will take your land, you towns, your loved ones, and make",
                "them all mine.  You will pay for your insolence.\"  Alzaphain leaps",
                "down, and suddenly pulls out a large black staff, the head of a dragon",
                "on the butt, and the blade a shimmering white.  It seems to vibrate as",
                "he holds it, most likely craving the taste of blood.  \"Don't hold back",
                "now, I want a real challenge.  And to make things interesting...\"  He",
                "slams the lance into the ground, and closes his eyes enchanting.  You",
                "try to rush him, but you find your legs immobile...  He has you under",
                "a spell!  A black mist begins to emanate from Alzaphain, and suddenly",
                "three more warriors appear.  One must be a wizard from his attire, the",
                "other a vampire and the third a warrior.\"  Well, then, let's get",
                "started!\"  You're legs gain their mobility, and not a moment too soon.",
                "You charge into the fray, you're only hope that god hasn't decided",
                "it's your time yet.  "
            ],
            "name": "Alzaphains Throneroom",
            "exits": {
                "south": {
                    "flags_raw": "0",
                    "room_id": "12276",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12277"
        },
        "12275": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "You no longer bother to clean your weapon, the sizzling sound",
                "reminding you of just how deep you are in your own mess.  Sighing, you",
                "really pray that all this effort will pay off and you will be welcomed",
                "back to your town a hero, rather than a coward he ran when the going",
                "got tough.  You look around, expecting a vampire to be hidden",
                "somewhere...  Only nothing happens.  Waiting for about five minutes,",
                "nothing happens, and you cannot hear any other breathing aside from",
                "your own.  Shrugging to yourself, and thanking your good luck, you",
                "begin to walk toward the opposite side of the room, only to be stopped",
                "by a falling bat.  The bat lands in front of you, his eyes blood red. ",
                "He then mouths something you cannot understand, and in a flash of red",
                "light, yet another black robed vampire stands before you.  \"TIME TO",
                "DIE!\"  He cries, and lunges for you.  "
            ],
            "name": "A Pitch Black Room",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12274",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12276",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12275"
        },
        "12255": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Tired, sleepy, and a bit afraid, you press on, sensing that there",
                "might be some sort of period of silence in this room.  However, you",
                "coulnd't be more wrong.  One of the warriors, and two more rangers are",
                "quickly gearing up at your presence.  You also notice that one of them",
                "holds a key at his belt, but to which door it unlocks, you have no",
                "idea.  You ready yourself as they charge you, crying out \"Invaders,",
                "Invaders!\"  "
            ],
            "name": "An Elaborate Room",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12256",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12254",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12255"
        },
        "12258": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "You finally find yourself on the last three steps, and although to",
                "you this room seems to represent nothing but death, you can't help but",
                "look out the window and admire the lovely landscape.  The rolling",
                "hills and valleys, the sparse trees, even a small town very very far",
                "in the distance.  While admiring the view, you hear the scurry of",
                "feet, and turn around to see a man cloaked all in black grinning at",
                "you, at least you think he is grinning.  \"Why have you come here?\"  He",
                "demands, and you realize he isn't grinning at all, he is growling. ",
                "\"We come to end the tyranny of Alzaphain, defend yourself nave or",
                "prepare to eat my sword!\"  He grins at you, not at all threatened at",
                "your idle threats, and quickly he pulls out a staff from under his",
                "cloak and beings some sort of incantation.  You quickly lunge for him,",
                "hoping to catch him before his spell is complete.  "
            ],
            "name": "Window Overlooking The Countryside",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12257",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12259",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12258"
        },
        "12265": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Out of breath, you lean against the door frame while your breath",
                "eventually catches up with you.  However, the very large mercenary",
                "wielding two rapiers and grinning wildly at you seems to think",
                "otherwise.  It quickly dawns on you that you are now in what seems to",
                "be the mercenary floor, at least that's what reason dictates. ",
                "Decorating the walls are all sorts of trinkets and treasures most",
                "likely taken at raiding parties, as well as weapons that seem to look",
                "somewhat alien to you.  Before you can look around more, the giant",
                "mercenary (which has been motionless the whole time) says \"Do you come",
                "here to look or to fight foreigners?  Prepare thyself!\"  "
            ],
            "name": "Mercinary Conference Room",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12264",
                    "description": [
                        ""
                    ]
                },
                "east": {
                    "flags_raw": "0",
                    "room_id": "12266",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12265"
        },
        "12274": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Once again cleaning your blade of the sizzling vampire blood, you",
                "press on, your only form of motivation the fact that this is the final",
                "floor.  And to no surprise, yet another vampire is waiting for you,",
                "smiling a toothy grin.  \"You are good warrior, but let me test your",
                "true skills.\"  With that, his grin suddenly becomes a wicked snarl,",
                "his teeth now fully bared as he lunges for your throat.  "
            ],
            "name": "A Pitch Black Room",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12273",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12275",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12274"
        },
        "12259": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "All this darkness is really beginning to shadow your mood. ",
                "Although you felt somewhat...  Happy at the beautiful landscape, all",
                "that seemed to be sucked away, just as the light.  You press on, fully",
                "aware that in every room, yet another danger awaits you.  You only",
                "hope that you can withstand all the torment and pain, at least until",
                "you get something worth all this trouble.  "
            ],
            "name": "Another Dark Hallway",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12258",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12260",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12259"
        },
        "12252": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [],
            "name": "A Dark Hallway",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12253",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12251",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12252"
        },
        "12257": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Weary, and tired, you continue your journey up the unforgiving",
                "stairway.  Already out of breath, you huff and puff but finially see a",
                "light at the very top of the staircase.  Hoping that there are none",
                "others like this, you quickly continue your journey.  "
            ],
            "name": "A Spiral Stairway",
            "exits": {
                "down": {
                    "flags_raw": "0",
                    "room_id": "12256",
                    "description": [
                        ""
                    ]
                },
                "south": {
                    "flags_raw": "0",
                    "room_id": "12258",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12257"
        },
        "12251": {
            "extras": {
                "mob": {
                    "description": [
                        ""
                    ]
                }
            },
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "{8The soul mat{Bter{b here {ris n{Rull to fe{rw as{b a sma{Bll {8path guides you ",
                "{8north towards{B th{be cast{rle. {R There are i{rnte{brestin{Bgg {8sounds around",
                "{8you, like so{Bmet{bhing y{rou h{Rave heard in a{r dr{beam.  {BThe{8y call to",
                "{8you almost {Bbeg{bging y{rou t{Ro remember.  Sma{rll {bideas {Band{8 people",
                "{8you once f{Borg{bot hin{rt at{R your mind like wo{rrds{b on th{Be t{8ip of your",
                "{8tongue.  {BThe{bn like{r wak{Ring up from a dream {rthe{by slow{Bly {8fade",
                "{8away.  T{Bher{be is n{rothi{Rng else you notice ahe{rad {bbut th{Be c{8astle."
            ],
            "name": "An Elaborate Room",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12252",
                    "description": [
                        ""
                    ]
                },
                "south": {
                    "flags_raw": "0",
                    "room_id": "12250",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12251"
        },
        "12254": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "You now know that this is the real thing, and that you don't want",
                "to mess around.  The dim light also doesn't help much, since you",
                "nearly bought the farm with the last mercinary run-in.  In fact, you",
                "feel slightly lucky that you were able to dodge that arrow.  Breathing",
                "a sigh of relief is one thing, however, that you know you do not have",
                "the priveledge to do.  The second you stepped into the hallway, yet",
                "another arrow just flew past you.  You quickly ready yourself for",
                "battle, thoughts of leaving now becomming more perswasive.  "
            ],
            "name": "A Dark Hallway",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12255",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12253",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12254"
        },
        "12261": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Wiping the blood off your weapons, you are happy that this is the",
                "end of yet another dark hallway.  The path lightens up a bit, and you",
                "are glad to be able to be aware of your surroundings.  After a quick",
                "look-around, you realize that this room seems to actually be empty. ",
                "Halfway through the hallway, something catches your eye.  You quickly",
                "turn to your left, but all you can see is the same concrete wall that",
                "you've seen almost the whole time during this little adventure. ",
                "Thinking this is yet another one of your mind games, you press on,",
                "only to stop after taking a step and this time turn to your right. ",
                "You then quickly step back as the wall moves toward you.  At least,",
                "that's what you think at first.  A voice suddenly utters \"Visibility\"",
                "and where the wall was, yet another cloaked figure lunges for you. ",
                "You barely have enough time to draw your weapons as he quickly",
                "approaches you.  "
            ],
            "name": "Another Dark Hallway",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12260",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12262",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12261"
        },
        "12276": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "You walk into the final room which leads to Alzaphains throne,",
                "wounds bleeding, heart throbbing, legs wobbling, but heart full of",
                "determination.  Surprisingly enough, the final room has lights, in",
                "fact it has an elaborate chandelier hanging from the ceiling, giving",
                "more than enough light to the room.  Putting out your torch, you",
                "approach the room cautiously.  \"So, you finally arrived.\"  A voice",
                "speaks, and you turn to face another black robed figure.  \"I waited a",
                "long time...  I always love a good challenge.\"  You prepare yourself",
                "as he walks across a chair to come face to face with you,",
                "approximately 10 paces away.  He stretches his hands out away from",
                "him, and begins to chant a language totally alien to you.  Suddenly,",
                "arms begin to grow out of his arms, and legs from out of his legs. ",
                "His chanting grows louder as two heads and bodies begin to form. ",
                "Suddenly, there are three people, exactly the same, standing before",
                "you.  You cry out as the three leap for you, snarling in anger and",
                "drooling for your blood.  "
            ],
            "name": "A Large Chamber",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12277",
                    "description": [
                        ""
                    ]
                },
                "east": {
                    "flags_raw": "0",
                    "room_id": "12275",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12276"
        },
        "12264": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "You're heart nearly sinks at the sight of yet another large",
                "stairway.  Feeling actually close to exhausted from that previous bout",
                "with Shizon, you don't really know if you can take much more.  But,",
                "you swallow your pride and continue, you won't let some stupid tower",
                "get the best of you.  Taking it one step at a time, you continue on",
                "even if your legs feel like they might go out from under you at any",
                "moment.  "
            ],
            "name": "A Spiral Stairway",
            "exits": {
                "down": {
                    "flags_raw": "0",
                    "room_id": "12263",
                    "description": [
                        ""
                    ]
                },
                "south": {
                    "flags_raw": "0",
                    "room_id": "12265",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12264"
        },
        "12268": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Closing the door behind you, you suddenly with you hadn't slammed",
                "the door shut.  One of the mercenary guards, who was in the process of",
                "fixing a ham and cheese sandwhich, suddenly looks strait at you. ",
                "Dropping the sandwhich to the floor, he quickly arms himself and",
                "charges for you.  "
            ],
            "name": "Royal Kitchen",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12269",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12267",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12268"
        },
        "12267": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Shaking your head slightly at the disturbing conversation you just",
                "had with Alexander, you venture on and find yourself in an elaborate",
                "ballroom.  A large crystal chandelier hangs from the ceiling, which",
                "illuminates the entire room.  It takes your eyes a few minutes to",
                "adjust to the light, but even as you shield your eyes from the",
                "illumination, you can still see the form of yet another mercenary",
                "guard approaching you.  Sighing to yourself, and damning your luck",
                "once more, you try to avoid the guard, but to no avail.  \"You are mine",
                "pathetic souls.  You may have defeated ol'Alexander, but you will",
                "never get past me.\"  Suddenly, in a blur of motion, he releases three",
                "daggers from his hands, all of which miss you, but only because you",
                "have just fallen backwards over a chair trying to avoid the mercenary.",
                "He laughs at you, and suddenly three more daggers appear from his",
                "hands.  \"As much as I hated that Alexander bastard, I can't believe he",
                "was beaten by fools like you.\"  Growling, you leap backwards and",
                "prepare yourself, your eyes as good as they're gonna be.  \"Oh, finally",
                "ready to fight?  Let's do it!\"  The three daggers then disappear, and",
                "instead two long swords are in his hands.  He then leaps for you,",
                "laughing.  "
            ],
            "name": "Ballroom",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12268",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12266",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12267"
        },
        "12273": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Cleaning the sizzling blood from your blades, you carelessly throw",
                "the rag away as you enter a second dark hallway.  Luckily, once you",
                "killed that vampire, you were able to get and light a torch.  Looking",
                "around, you notice that these rooms have no furniture whatsoever, and",
                "in their place rests countless bones of creatures both familiar and",
                "alien to you.  Sighing, you continue on, only to once again be stopped",
                "by yet another black-robed form.  He looks up at you, his red eyes",
                "dancing fire in your torchlight.  He smiles, his fangs growing longer",
                "as he looks at you.  \"You will never be able to leave this tower",
                "alive!\"  He says, and calmly walks toward you.  You rush him, swinging",
                "your sword at his head, only for your blade to find nothing but air. ",
                "Turning quickly, you notice him behind you, his fangs already nearing",
                "your throat.  "
            ],
            "name": "A Pitch Black Room",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12272",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12274",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12273"
        },
        "12269": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Once again, you find yourself in another large library, with books",
                "and scrolls strewn about the premises.  However, you don't really care",
                "much about your surroundings, for right in front of you are two",
                "mercenary guards and one of those wizards from the last floor, all of",
                "whom immediately bolt upright and arm themselves at your intrusion. ",
                "You don't even have time to mouth \"Oh Crap\" before one of the three",
                "guards leaps for you.  "
            ],
            "name": "Library",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12270",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12268",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12269"
        },
        "12260": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Your fears and imagination seem to have gotten the best of you, for",
                "at your own sounds did you jump and prepare for an assault.  You",
                "calmly reassure yourself at every other noise you hear, but you",
                "reassurances fall on deaf ears.  Quickening your pace a bit, as you",
                "are now in the darkest part of the hallway, you find yourself stopped",
                "in your tracks once again by a floating figure.  He glares at you",
                "menacingly, his staff upraised, his eyes beaming white light....  You",
                "almost have to back away at it's brightness.  \"You will advance no",
                "more, weary travelers.  This is your last stop!\"  He quickly hovers",
                "toward you, laughing maniacally as you rush at him.  "
            ],
            "name": "Another Dark Hallway",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12259",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12261",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12260"
        },
        "12270": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "As quietly as possible, you walk into the chamber of the final",
                "general, in hopes he may be asleep and not notice you.  Sighing with",
                "relief, you notice that he actually IS asleep, or at least meditating.",
                "Aralim doesn't move, so you quickly yet quietly try to sneak past him",
                "in hopes of avoiding him.  If only your luck were that great.  \"Who",
                "dares attempt to sneak past the great Aralim, second in command to",
                "Alzaphain.\"  The figure doesn't move, but you can tell immediatly that",
                "you are found out.  Growling at your luck, you manage a response.  \"We",
                "are here to defeat the great Alzaphain, and end his rule of tyranny!\" ",
                "The figure appears in front of you, and you suddenly realize...  He is",
                "a vampire!  Grinning at you, his white fangs shining in the light, he",
                "suddenly disappears again.  Turning around, you notice him behind you,",
                "half in the shadows, half in the light.  His eyes are a very bright",
                "red, and he seems to be salivating as he gazes upon you.  \"I",
                "believe...\"  He starts as he slowly walks toward you, \"that it is",
                "feeding time.\"  "
            ],
            "name": "Aralim's Chamber",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "room_id": "12271",
                    "description": [
                        ""
                    ]
                },
                "south": {
                    "flags_raw": "0",
                    "room_id": "12269",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12270"
        },
        "12256": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Wiping the blood off your weapons, you quickly hasten your step,",
                "only to be stopped once more, this time by a very large man.  \"How did",
                "you get in hear?  Guards?\"  He cries, but you smile meekly, knowing",
                "that you already took care of them.  He sighs when no one comes, and",
                "quickly stand up, a sword you never knew he had near him in his hands,",
                "his edge pointing strait at you.  \"Must I do EVERYTHING myself?\"  He",
                "asks, and quickly charges at you.  "
            ],
            "name": "Slades Office",
            "exits": {
                "up": {
                    "flags_raw": "0",
                    "room_id": "12257",
                    "description": [
                        ""
                    ]
                },
                "south": {
                    "flags_raw": "0",
                    "room_id": "12255",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12256"
        },
        "12266": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Pocketing the large sum of money from the mercenaries corpse, you",
                "sigh to yourself as you approach yet another dark hallway.  However,",
                "this one seems a bit different from the rest.  Rather than a large",
                "hallway which leads into pitch blackness, you can actually make out an",
                "oak door on the opposite side of where you are standing.  However,",
                "nearly a foot in front of that door is yet another mercenary guard,",
                "both his swords out, which shine brightly in the dim light.  \"You are",
                "fools for coming here\" he says as he approaches you.  He then slowly",
                "lowers his weapons, and sheaths his swords.  Walking around you, still",
                "eyeing you cautiously, he takes a seat at a desk on the left side of",
                "the hallway.  "
            ],
            "name": "Dimly Lit Passage",
            "exits": {
                "east": {
                    "flags_raw": "0",
                    "room_id": "12267",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12265",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12266"
        },
        "12262": {
            "extras": {},
            "flags_raw": "0 0 0 0",
            "flags2_raw": "0",
            "description": [
                "Feeling like the unluckiest person in the world, you continue on,",
                "even though every bone in your body is begging you didn't.  Hoping",
                "that the worst is perhaps finially over, you're little idea is quickly",
                "disillusioned as your location suddenly dawns on you.  There is a",
                "large wooden circular table in the center of this room, on which many",
                "books lay.  Decorating the walls are books upon books, as well as",
                "scrolls and other objects emanating magical auras.  Your little",
                "sight-seeing session is cut short as three more of the magi you've",
                "been fighting bolt upright in the seats at the large table, and",
                "quickly run in your direction.  \"To get this far\" one of them yells",
                "\"they must have slain our friends.  Let us have no mercy on these men,",
                "leave nothing to identify them!\"  The other two nod, and begin weaving",
                "a magical spell as they run at you.  "
            ],
            "name": "Alzaphains Mages Conference Room",
            "exits": {
                "north": {
                    "flags_raw": "0",
                    "room_id": "12263",
                    "description": [
                        ""
                    ]
                },
                "east": {
                    "flags_raw": "0",
                    "room_id": "12261",
                    "description": [
                        ""
                    ]
                },
                "west": {
                    "flags_raw": "0",
                    "room_id": "12278",
                    "description": [
                        ""
                    ]
                }
            },
            "wanted_area_vnum": "",
            "vnum": "12262"
        }
    },
    "credits": "[ CLOSED ] Zindel-Thorn",
    "faction_id": "",
    "name": "Zindel-Thorn",
    "vnums": [
        12250,
        12299
    ],
    "realm_id": 3,
    "subroutines": [],
    "mobiles": {
        "12256": {
            "d_flags": "D \"Damn....i'll...be...back!\"~",
            "raw_flags3": "-4 -4 -4 -15",
            "description": [
                "Small but deadly, this little Ranger was bought by Alzaphain to\n",
                "protect his home, and for a hefty price.  Being a mercinary, her\n",
                "skills are second to none, so one would watch out if they crossed her\n",
                "path.  \n"
            ],
            "raw_flags5": "stand stand female 2147483647",
            "vnum": 12256,
            "raw_flags": "ABEFGd V 0 -1000 1",
            "raw_flags4": "0 ABJX L K",
            "room_name": "A short but deadly Ranger is here, aiming right between your eyes.\n",
            "name": "An Evil Ranger~\n",
            "raw_flags2": "99 5 350d350+0 10d10+200 100d100+350 none",
            "keywords": "Deadly Ranger~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium skin",
            "race_id": "human",
            "t_flags": "T \"Invaders!\"~"
        },
        "12257": {
            "d_flags": "D \"Ungh.....\"~",
            "raw_flags3": "-4 -4 -4 -15",
            "description": [
                "Small but deadly, this little Ranger was bought by Alzaphain to\n",
                "protect his home, and for a hefty price.  Being a mercinary, her\n",
                "skills are second to none, so one would watch out if they crossed her\n",
                "path.  \n"
            ],
            "raw_flags5": "stand stand female 100000",
            "vnum": 12257,
            "raw_flags": "ABEFGd V 0 -1000 1",
            "raw_flags4": "0 ABJX L K",
            "room_name": "A short but deadly Ranger is here, aiming right between your eyes.\n",
            "name": "An Evil Ranger~\n",
            "raw_flags2": "99 5 350d350+0 0d0+0 100d100+350 none",
            "keywords": "Deadly Ranger~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium skin",
            "race_id": "human",
            "t_flags": "T \"Invaders!\"~"
        },
        "12258": {
            "d_flags": "D \"Damn....got...me....ungh\"~",
            "raw_flags3": "-6 -6 -6 -20",
            "description": [
                "Slade is large, and in charge. He doesn't take crap from anybody, and espically not invaders. You decide that comming here prehaps wasn't the best of ideas, once you meet this bad boy.\n"
            ],
            "raw_flags5": "stand stand male 10000000",
            "vnum": 12258,
            "raw_flags": "ABFGTd Va 0 -1000 0",
            "raw_flags4": "BEFJK ABMN F IK",
            "room_name": "A large, strong looking man is here. He growls at your entrance.\n",
            "name": "Slade~\n",
            "raw_flags2": "100 7 450d450+200 0d0+0 150d150+400 none",
            "keywords": "Slade~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium unknown",
            "race_id": "human",
            "t_flags": "T \"Well, well, what have we here?\"~"
        },
        "12259": {
            "d_flags": "D \"I'll...meet...you in..he..l.l...~",
            "raw_flags3": "-4 -4 -4 -20",
            "description": [
                "The Dark Archmages of Branchiek Tower are the strongest of the\n",
                "land, able to bend to their whim whatever they see fit.  Those who\n",
                "have been able to witness their power have, as of late, never returned\n",
                "to tell of their tale.  The Dark Archmages are feared and reveared\n",
                "throughout the land, and will follow any cause for the promise of\n",
                "ultimate power.  \n"
            ],
            "raw_flags5": "stand stand male 10000000",
            "vnum": 12259,
            "raw_flags": "ABFRd V CDE -1000 0",
            "raw_flags4": "H ABM CHI N",
            "room_name": "A Dark Clad Man, Preparing a Spell\n",
            "name": "A Dark Archmage~\n",
            "raw_flags2": "100 6 350d350+100 200d200+200 75d75+200 magic",
            "keywords": "Dark Archmage~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium flesh",
            "race_id": "human",
            "t_flags": "T ~"
        },
        "12260": {
            "d_flags": "D \"The shadows...will...overcome...you..~",
            "raw_flags3": "-4 -4 -4 -20",
            "description": [
                "The Dark Archmages of Branchiek Tower are the strongest of the\n",
                "land, able to bend their whim whatever they see fit.  Those who have\n",
                "been able to witness their power have , as of late, never returned to\n",
                "tell of their tale.  The Dark Archmages are feared and reveared\n",
                "throughout the land, and will follow any cause for the promise of\n",
                "ultimate power.  \n"
            ],
            "raw_flags5": "stand stand male 10000000",
            "vnum": 12260,
            "raw_flags": "ABFRd V CDE -1000 0",
            "raw_flags4": "H ABM CHI N",
            "room_name": "A Dark Clad Man, Preparing a Spell\n",
            "name": "A Dark Archmage~\n",
            "raw_flags2": "100 6 350d350+100 200d200+200 75d75+200 magic",
            "keywords": "Dark Archmage~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium flesh",
            "race_id": "human",
            "t_flags": "T ~"
        },
        "12261": {
            "d_flags": "D \"The shadows...will....overcome...you...~",
            "raw_flags3": "-4 -4 -4 -20",
            "description": [
                "The Dark Archmages of Branchiek Tower are the strongest of the\n",
                "land, able to bend their whim whatever they see fit.  Those who have\n",
                "been able to witness their power have , as of late, never returned to\n",
                "tell of their tale.  The Dark Archmages are feared and reveared\n",
                "throughout the land, and will follow any cause for the promise of\n",
                "ultimate power.  \n"
            ],
            "raw_flags5": "stand stand male 10000000",
            "vnum": 12261,
            "raw_flags": "ABFRd V CDE -1000 0",
            "raw_flags4": "H ABM 0 N",
            "room_name": "A Dark Clad Man, Preparing a Spell\n",
            "name": "A Dark Archmage~\n",
            "raw_flags2": "100 6 350d350+100 200d200+200 75d75+200 magic",
            "keywords": "Dark Archmage~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium flesh",
            "race_id": "human",
            "t_flags": "T ~"
        },
        "12262": {
            "d_flags": "D ~",
            "raw_flags3": "-4 -4 -4 -20",
            "description": [],
            "raw_flags5": "stand stand male 0",
            "vnum": 12262,
            "raw_flags": "ABFRd V CDE -1000 0",
            "raw_flags4": "0 0 0 0",
            "room_name": "(no long description)\n",
            "name": "(no short description)~\n",
            "raw_flags2": "100 6 350d350+100 0d0+0 0d0+0 magic",
            "keywords": "Dark Archmage~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium unknown",
            "race_id": "human",
            "t_flags": "T ~"
        },
        "12298": {
            "d_flags": "D ~",
            "raw_flags3": "0 0 0 0",
            "description": [],
            "raw_flags5": "stand stand male 99999",
            "vnum": 12298,
            "raw_flags": "ABG DF 0 0 0",
            "raw_flags4": "0 0 0 0",
            "room_name": "A big Doofus\n",
            "name": "A big Doofus~\n",
            "raw_flags2": "101 1 2d2+2 2d2+2 0d0+0 none",
            "keywords": "Doofus petseller~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium unknown",
            "race_id": "human",
            "t_flags": "T ~"
        },
        "12251": {
            "d_flags": "D \"You...will never...see the..m..a...ss..t..e.r...\"~",
            "raw_flags3": "-3 -3 -3 -15",
            "description": [
                "The Tower Guard isn't a very bright person, but he knows where his\n",
                "allies lay.  He notices you come in and immediatly charges his attack.\n",
                "You shiver in fear as his huge double-edged sword threatens to tear\n",
                "the flesh from your very bones.  You quickly ready yourslef, but you\n",
                "hear a small voice in your mind say \"Perhaps, we shouldn't have come.\"\n"
            ],
            "raw_flags5": "stand stand male 100000",
            "vnum": 12251,
            "raw_flags": "ABFGTd 0 0 -1000 0",
            "raw_flags4": "BCDEK ABE F C",
            "room_name": "A large Tower Guard stands here, ready to lob your head off.\n",
            "name": "The Tower Guard~\n",
            "raw_flags2": "99 5 400d400+0 0d0+0 100d100+400 none",
            "keywords": "Tower Guard~\n",
            "subroutines": [
                "M greet 12251 100~\n"
            ],
            "raw_flags6": "AHMV ABCDEFGHIJK medium armor",
            "race_id": "human",
            "t_flags": "T You dare enter Branchiek Tower? Die fool!~"
        },
        "12252": {
            "d_flags": "D \"Rot...in...hell....\"~",
            "raw_flags3": "-3 -3 -3 -15",
            "description": [
                "The Tower Guard isn't a very bright person, but he knows where his\n",
                "allies lay.  He notices you come in and immediatly charges his attack.\n",
                "You shiver in fear as his huge double-edged sword threatens to tear\n",
                "the flesh from your very bones.  You quickly ready yourself, but you\n",
                "hear a small voice in your mind say \"Perhaps, we shouldn't have come.\"\n"
            ],
            "raw_flags5": "stand stand male 100000",
            "vnum": 12252,
            "raw_flags": "ABFGTd 0 0 -1000 0",
            "raw_flags4": "BCDEK ABE F C",
            "room_name": "A large Tower Guard stands here, ready to lob your head off.\n",
            "name": "The Tower Guard~\n",
            "raw_flags2": "99 5 400d400+0 0d0+0 100d100+400 none",
            "keywords": "Tower Guard~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium armor",
            "race_id": "human",
            "t_flags": "T You killed my friend, time to DIE!~"
        },
        "12253": {
            "d_flags": "D \"Never...shoulda...missed...the..arrow~",
            "raw_flags3": "-4 -4 -4 -15",
            "description": [
                "Small but deadly, this little Ranger was bought by Alzaphain to\n",
                "protect his home, and for a hefty price.  Being a mercinary, her\n",
                "skills are second to none, so one would watch out if they crossed her\n",
                "path.  \n"
            ],
            "raw_flags5": "stand stand female 100000",
            "vnum": 12253,
            "raw_flags": "ABEFGd V 0 -1000 0",
            "raw_flags4": "0 ABJX L K",
            "room_name": "A short but deadly Ranger is here, aiming right between your eyes.\n",
            "name": "An Evil Ranger~\n",
            "raw_flags2": "99 5 350d350+100 10d10+200 100d100+350 none",
            "keywords": "Deadly Ranger~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium skin",
            "race_id": "human",
            "t_flags": "T \"Time to die!\"~"
        },
        "12254": {
            "d_flags": "D \"Ahhh....my...arrow....has...failed...me!\"~",
            "raw_flags3": "-4 -4 -4 -15",
            "description": [
                "Small but deadly, this little Ranger was bought by Alzaphain to\n",
                "protect his home, and for a hefty price.  Being a mercinary, her\n",
                "skills are second to none, so one would watch out if they crossed her\n",
                "path.  \n"
            ],
            "raw_flags5": "stand stand female 100000",
            "vnum": 12254,
            "raw_flags": "ABEFGd V 0 -1000 0",
            "raw_flags4": "0 ABJX L K",
            "room_name": "A short but deadly Ranger is here, aiming right between your eyes.\n",
            "name": "An Evil Ranger~\n",
            "raw_flags2": "99 5 350d350+100 10d10+200 100d100+350 none",
            "keywords": "Deadly Ranger~\n",
            "subroutines": [],
            "raw_flags6": "AHMV ABCDEFGHIJK medium skin",
            "race_id": "human",
            "t_flags": "T \"Arrow, fly!\"~"
        },
        "12255": {
            "raw_parts": "ABCDEFGHIJK",
            "d_flags": "D \"You...will never...see the..m..a...ss..t..e..r....\"~",
            "raw_flags3": "-3 -3 -3 -15",
            "description": [
                "The Tower Guard isn't a very bright person, but he knows where his\n",
                "allies lay.  He notices you come in and immediatly charges his attack.\n",
                "You shiver in fear as his huge double-edged sword threatens to tear\n",
                "the flesh from your very bones.  You quickly ready yourslef, but you\n",
                "hear a small voice in your mind say \"Perhaps, we shouldn't have come.\"\n"
            ],
            "raw_flags5": "stand stand male 100000",
            "vnum": 12255,
            "raw_flags": "ABFGTd 0 0 -1000 1",
            "raw_flags4": "BCDEK ABE F C",
            "room_name": "A large Tower Guard stands here, ready to lob your head off.\n",
            "name": "The Tower Guard~\n",
            "raw_flags2": "99 5 400d400+0 0d0+0 100d100+400 none",
            "raw_form": "AHMV",
            "keywords": "Tower Guard~\n",
            "subroutines": [
                "F for AHMV\n",
                "F par ABCDEFGHIJK\n"
            ],
            "raw_flags6": "0 0 medium armor",
            "race_id": "human",
            "t_flags": "T Invaders, Invaders!~"
        }
    },
    "area_quest_points": 0
}